/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe { *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize) };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)

#[doc = "Function prototype for antenna switching callback in Channel Sounding.\n\n See also sdc_support_channel_sounding\n\n # Arguments\n\n* `[in]` -antenna_index The index of the antenna being switched to.\n Valid range sdc_cfg_cs_cfg_t::num_antennas_supported - 1]"]
pub type sdc_cs_antenna_switch_callback_t = ::core::option::Option<unsafe extern "C" fn(antenna_index: u8)>;
#[doc = "No configuration update."]
pub const SDC_CFG_TYPE_NONE: sdc_cfg_type = 0;
#[doc = "See sdc_cfg_t::central_count."]
pub const SDC_CFG_TYPE_CENTRAL_COUNT: sdc_cfg_type = 1;
#[doc = "See sdc_cfg_t::peripheral_count."]
pub const SDC_CFG_TYPE_PERIPHERAL_COUNT: sdc_cfg_type = 2;
#[doc = "See sdc_cfg_t::buffer_cfg."]
pub const SDC_CFG_TYPE_BUFFER_CFG: sdc_cfg_type = 3;
#[doc = "See sdc_cfg_t::adv_count."]
pub const SDC_CFG_TYPE_ADV_COUNT: sdc_cfg_type = 4;
#[doc = "See sdc_cfg_t::scan_buffer_cfg."]
pub const SDC_CFG_TYPE_SCAN_BUFFER_CFG: sdc_cfg_type = 5;
#[doc = "See sdc_cfg_t::adv_buffer_cfg."]
pub const SDC_CFG_TYPE_ADV_BUFFER_CFG: sdc_cfg_type = 6;
#[doc = "See sdc_cfg_t::fal_size"]
pub const SDC_CFG_TYPE_FAL_SIZE: sdc_cfg_type = 7;
#[doc = "See sdc_cfg_t::periodic_adv_count."]
pub const SDC_CFG_TYPE_PERIODIC_ADV_COUNT: sdc_cfg_type = 8;
#[doc = "See sdc_cfg_t::periodic_sync_count."]
pub const SDC_CFG_TYPE_PERIODIC_SYNC_COUNT: sdc_cfg_type = 9;
#[doc = "See sdc_cfg_t::periodic_sync_buffer_cfg."]
pub const SDC_CFG_TYPE_PERIODIC_SYNC_BUFFER_CFG: sdc_cfg_type = 10;
#[doc = "See sdc_cfg_t::periodic_adv_list_size."]
pub const SDC_CFG_TYPE_PERIODIC_ADV_LIST_SIZE: sdc_cfg_type = 11;
#[doc = "See sdc_cfg_t::periodic_adv_rsp_count."]
pub const SDC_CFG_TYPE_PERIODIC_ADV_RSP_COUNT: sdc_cfg_type = 12;
#[doc = "See sdc_cfg_t::periodic_adv_rsp_buffer_cfg."]
pub const SDC_CFG_TYPE_PERIODIC_ADV_RSP_BUFFER_CFG: sdc_cfg_type = 13;
#[doc = "See sdc_cfg_t::periodic_adv_rsp_failure_reporting_cfg."]
pub const SDC_CFG_TYPE_PERIODIC_ADV_RSP_FAILURE_REPORTING_CFG: sdc_cfg_type = 14;
#[doc = "See sdc_cfg_t::periodic_sync_rsp_tx_buffer_cfg."]
pub const SDC_CFG_TYPE_PERIODIC_SYNC_RSP_TX_BUFFER_CFG: sdc_cfg_type = 15;
#[doc = "See sdc_cfg_t::cig_count."]
pub const SDC_CFG_TYPE_CIG_COUNT: sdc_cfg_type = 16;
#[doc = "See sdc_cfg_t::cis_count."]
pub const SDC_CFG_TYPE_CIS_COUNT: sdc_cfg_type = 17;
#[doc = "See sdc_cfg_t::big_count."]
pub const SDC_CFG_TYPE_BIG_COUNT: sdc_cfg_type = 18;
#[doc = "See sdc_cfg_t::bis_sink_count."]
pub const SDC_CFG_TYPE_BIS_SINK_COUNT: sdc_cfg_type = 19;
#[doc = "See sdc_cfg_t::bis_source_count."]
pub const SDC_CFG_TYPE_BIS_SOURCE_COUNT: sdc_cfg_type = 20;
#[doc = "See sdc_cfg_t::iso_buffer_cfg."]
pub const SDC_CFG_TYPE_ISO_BUFFER_CFG: sdc_cfg_type = 21;
#[doc = "See sdc_cfg_t::cs_count."]
pub const SDC_CFG_TYPE_CS_COUNT: sdc_cfg_type = 22;
#[doc = "See sdc_cfg_t::cs_cfg."]
pub const SDC_CFG_TYPE_CS_CFG: sdc_cfg_type = 23;
pub type sdc_cfg_type = ::core::ffi::c_uint;
#[doc = "Role count."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_role_count_t {
    #[doc = "< Max number of concurrent roles."]
    pub count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_role_count_t"][::core::mem::size_of::<sdc_cfg_role_count_t>() - 1usize];
    ["Alignment of sdc_cfg_role_count_t"][::core::mem::align_of::<sdc_cfg_role_count_t>() - 1usize];
    ["Offset of field: sdc_cfg_role_count_t::count"][::core::mem::offset_of!(sdc_cfg_role_count_t, count) - 0usize];
};
#[doc = "Buffer configuration."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_buffer_cfg_t {
    #[doc = "< Link Layer TX packet size. Valid range: 27-251.\nDefault: SDC_DEFAULT_TX_PACKET_SIZE."]
    pub tx_packet_size: u16,
    #[doc = "< Link Layer RX packet size. Valid range: 27-251.\nDefault: SDC_DEFAULT_RX_PACKET_SIZE."]
    pub rx_packet_size: u16,
    #[doc = "< Link Layer TX packet count per link. Minimum of 1.\nDefault: SDC_DEFAULT_TX_PACKET_COUNT."]
    pub tx_packet_count: u8,
    #[doc = "< Link Layer RX packet count per link. Minimum of 1.\nDefault: SDC_DEFAULT_RX_PACKET_COUNT."]
    pub rx_packet_count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_buffer_cfg_t"][::core::mem::size_of::<sdc_cfg_buffer_cfg_t>() - 6usize];
    ["Alignment of sdc_cfg_buffer_cfg_t"][::core::mem::align_of::<sdc_cfg_buffer_cfg_t>() - 2usize];
    ["Offset of field: sdc_cfg_buffer_cfg_t::tx_packet_size"]
        [::core::mem::offset_of!(sdc_cfg_buffer_cfg_t, tx_packet_size) - 0usize];
    ["Offset of field: sdc_cfg_buffer_cfg_t::rx_packet_size"]
        [::core::mem::offset_of!(sdc_cfg_buffer_cfg_t, rx_packet_size) - 2usize];
    ["Offset of field: sdc_cfg_buffer_cfg_t::tx_packet_count"]
        [::core::mem::offset_of!(sdc_cfg_buffer_cfg_t, tx_packet_count) - 4usize];
    ["Offset of field: sdc_cfg_buffer_cfg_t::rx_packet_count"]
        [::core::mem::offset_of!(sdc_cfg_buffer_cfg_t, rx_packet_count) - 5usize];
};
#[doc = "Buffer count configuration."]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_buffer_count_t {
    #[doc = "< Number of buffers."]
    pub count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_buffer_count_t"][::core::mem::size_of::<sdc_cfg_buffer_count_t>() - 1usize];
    ["Alignment of sdc_cfg_buffer_count_t"][::core::mem::align_of::<sdc_cfg_buffer_count_t>() - 1usize];
    ["Offset of field: sdc_cfg_buffer_count_t::count"][::core::mem::offset_of!(sdc_cfg_buffer_count_t, count) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_adv_buffer_cfg_t {
    #[doc = "The maximum advertising data length that can be used by an advertiser\n\n If set to 31, the controller will support 31 bytes of advertising data and scan response data.\n Setting a value larger than 31 bytes is only useful when supporting extended advertising.\n\n Default: SDC_DEFAULT_ADV_BUF_SIZE."]
    pub max_adv_data: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_adv_buffer_cfg_t"][::core::mem::size_of::<sdc_cfg_adv_buffer_cfg_t>() - 2usize];
    ["Alignment of sdc_cfg_adv_buffer_cfg_t"][::core::mem::align_of::<sdc_cfg_adv_buffer_cfg_t>() - 2usize];
    ["Offset of field: sdc_cfg_adv_buffer_cfg_t::max_adv_data"]
        [::core::mem::offset_of!(sdc_cfg_adv_buffer_cfg_t, max_adv_data) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_periodic_adv_rsp_buffer_cfg_t {
    #[doc = "Configures the size of the buffer pool allocated to each periodic\n advertising set with responses for subevent data.\n\n Default: SDC_DEFAULT_PERIODIC_ADV_RSP_TX_BUFFER_COUNT."]
    pub tx_buffer_count: u8,
    #[doc = "Configures the maximum amount of data which can be sent in a PAwR subevent.\n\n Default: SDC_DEFAULT_PERIODIC_ADV_RSP_MAX_TX_DATA."]
    pub max_tx_data_size: u8,
    #[doc = "Configures the size of the buffer pool allocated to each periodic\n advertising set with responses for response reports.\n\n The value can be set to 0 to disable listening for responses.\n\n Default: SDC_DEFAULT_PERIODIC_ADV_RSP_RX_BUFFER_COUNT."]
    pub rx_buffer_count: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_periodic_adv_rsp_buffer_cfg_t"]
        [::core::mem::size_of::<sdc_cfg_periodic_adv_rsp_buffer_cfg_t>() - 3usize];
    ["Alignment of sdc_cfg_periodic_adv_rsp_buffer_cfg_t"]
        [::core::mem::align_of::<sdc_cfg_periodic_adv_rsp_buffer_cfg_t>() - 1usize];
    ["Offset of field: sdc_cfg_periodic_adv_rsp_buffer_cfg_t::tx_buffer_count"]
        [::core::mem::offset_of!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t, tx_buffer_count) - 0usize];
    ["Offset of field: sdc_cfg_periodic_adv_rsp_buffer_cfg_t::max_tx_data_size"]
        [::core::mem::offset_of!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t, max_tx_data_size) - 1usize];
    ["Offset of field: sdc_cfg_periodic_adv_rsp_buffer_cfg_t::rx_buffer_count"]
        [::core::mem::offset_of!(sdc_cfg_periodic_adv_rsp_buffer_cfg_t, rx_buffer_count) - 2usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_iso_buffer_cfg_t {
    #[doc = "Configures the number of shared SDU TX buffers allocated for ISO.\n\n Default: SDC_DEFAULT_ISO_TX_SDU_BUFFER_COUNT."]
    pub tx_sdu_buffer_count: u8,
    #[doc = "Configures the size of shared SDU TX buffers allocated for ISO.\n\n Default: SDC_DEFAULT_ISO_TX_SDU_BUFFER_SIZE."]
    pub tx_sdu_buffer_size: u16,
    #[doc = "Configures the number of TX PDU buffers allocated per ISO stream.\n\n This is the number of maximum size (251 bytes) PDU buffers. When PDU size is smaller\n than the maximum size, the pool will be repartitioned into a larger number of adjusted PDUs.\n\n For BIS, this value is used to determine the furthest PDU that can be stored in the buffers.\n Therefore, limiting the number of pretransmission subevents and maximum pretransmission offset (PTO)\n that the controller can use.\n\n Default: SDC_DEFAULT_ISO_TX_PDU_BUFFER_PER_STREAM_COUNT."]
    pub tx_pdu_buffer_per_stream_count: u8,
    #[doc = "Configures the number of RX PDU buffers allocated per ISO stream.\n\n This is the number of maximum size (251 bytes) PDU buffers. When PDU size is smaller\n than the maximum size, the pool will be repartitioned into a larger number of adjusted PDUs.\n\n For BIS, this value determines how many pretransmissions can be stored and utilized.\n\n Default: SDC_DEFAULT_ISO_RX_PDU_BUFFER_PER_STREAM_COUNT."]
    pub rx_pdu_buffer_per_stream_count: u8,
    #[doc = "Configures the number of RX SDU buffers allocated for ISO.\n\n Default: SDC_DEFAULT_ISO_RX_SDU_BUFFER_COUNT."]
    pub rx_sdu_buffer_count: u8,
    #[doc = "Configures the size of RX SDU buffers allocated for ISO.\n\n Default: SDC_DEFAULT_ISO_RX_SDU_BUFFER_SIZE."]
    pub rx_sdu_buffer_size: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_iso_buffer_cfg_t"][::core::mem::size_of::<sdc_cfg_iso_buffer_cfg_t>() - 10usize];
    ["Alignment of sdc_cfg_iso_buffer_cfg_t"][::core::mem::align_of::<sdc_cfg_iso_buffer_cfg_t>() - 2usize];
    ["Offset of field: sdc_cfg_iso_buffer_cfg_t::tx_sdu_buffer_count"]
        [::core::mem::offset_of!(sdc_cfg_iso_buffer_cfg_t, tx_sdu_buffer_count) - 0usize];
    ["Offset of field: sdc_cfg_iso_buffer_cfg_t::tx_sdu_buffer_size"]
        [::core::mem::offset_of!(sdc_cfg_iso_buffer_cfg_t, tx_sdu_buffer_size) - 2usize];
    ["Offset of field: sdc_cfg_iso_buffer_cfg_t::tx_pdu_buffer_per_stream_count"]
        [::core::mem::offset_of!(sdc_cfg_iso_buffer_cfg_t, tx_pdu_buffer_per_stream_count) - 4usize];
    ["Offset of field: sdc_cfg_iso_buffer_cfg_t::rx_pdu_buffer_per_stream_count"]
        [::core::mem::offset_of!(sdc_cfg_iso_buffer_cfg_t, rx_pdu_buffer_per_stream_count) - 5usize];
    ["Offset of field: sdc_cfg_iso_buffer_cfg_t::rx_sdu_buffer_count"]
        [::core::mem::offset_of!(sdc_cfg_iso_buffer_cfg_t, rx_sdu_buffer_count) - 6usize];
    ["Offset of field: sdc_cfg_iso_buffer_cfg_t::rx_sdu_buffer_size"]
        [::core::mem::offset_of!(sdc_cfg_iso_buffer_cfg_t, rx_sdu_buffer_size) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_cfg_cs_cfg_t {
    #[doc = "Configures the maximum number of antenna paths supported in Channel Sounding.\n Valid range 4].\n\n Default: SDC_DEFAULT_CS_MAX_ANTENNA_PATHS_SUPPORTED."]
    pub max_antenna_paths_supported: u8,
    #[doc = "Configures the number of antennas supported by the local device in Channel Sounding.\n Valid range max_antenna_paths_supported].\n\n Default: SDC_DEFAULT_CS_NUM_ANTENNAS_SUPPORTED."]
    pub num_antennas_supported: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_cs_cfg_t"][::core::mem::size_of::<sdc_cfg_cs_cfg_t>() - 2usize];
    ["Alignment of sdc_cfg_cs_cfg_t"][::core::mem::align_of::<sdc_cfg_cs_cfg_t>() - 1usize];
    ["Offset of field: sdc_cfg_cs_cfg_t::max_antenna_paths_supported"]
        [::core::mem::offset_of!(sdc_cfg_cs_cfg_t, max_antenna_paths_supported) - 0usize];
    ["Offset of field: sdc_cfg_cs_cfg_t::num_antennas_supported"]
        [::core::mem::offset_of!(sdc_cfg_cs_cfg_t, num_antennas_supported) - 1usize];
};
#[doc = "SoftDevice Controller configuration."]
#[repr(C)]
#[derive(Copy, Clone)]
pub union sdc_cfg_t {
    #[doc = "Max number of concurrent central connections.\n Default: SDC_DEFAULT_CENTRAL_COUNT."]
    pub central_count: sdc_cfg_role_count_t,
    #[doc = "Max number of concurrent peripheral connections.\n Default: SDC_DEFAULT_PERIPHERAL_COUNT."]
    pub peripheral_count: sdc_cfg_role_count_t,
    #[doc = "Configures the number and size of the data buffers available per link.\n Default: See sdc_cfg_buffer_cfg_t."]
    pub buffer_cfg: sdc_cfg_buffer_cfg_t,
    #[doc = "Max number of concurrent advertisers.\n Must be more than or equal to sdc_cfg_t::periodic_adv_count.\n Default: SDC_DEFAULT_ADV_COUNT."]
    pub adv_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of advertising reports available in the scanner.\n\n The minimum allowed number of buffers is 2.\n\n It is recommended to support at least three buffers,\n otherwise the scan response report will likely not be generated.\n\n Default: SDC_DEFAULT_SCAN_BUFFER_COUNT."]
    pub scan_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = "Configures the maximum advertising data per advertising set.\n Default: See sdc_cfg_adv_buffer_cfg_t."]
    pub adv_buffer_cfg: sdc_cfg_adv_buffer_cfg_t,
    #[doc = "Configures the maximum size of the Filter Accept List.\n\n Default: SDC_DEFAULT_FAL_SIZE."]
    pub fal_size: u16,
    #[doc = "Configures the maximum number of concurrent periodic advertisers.\n Must be less than or equal to sdc_cfg_t::adv_count.\n Default: SDC_DEFAULT_PERIODIC_ADV_COUNT."]
    pub periodic_adv_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of concurrent synchronizations\n to periodic advertisers.\n Default: SDC_DEFAULT_PERIODIC_SYNC_COUNT."]
    pub periodic_sync_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of periodic advertising reports available\n for each synchronization to a periodic advertiser.\n\n Each synchronization to a periodic advertiser allocates its own buffer\n pool.\n\n When periodic sync with responses is not supported,\n the minimum allowed number of buffers is 2.\n\n When periodic sync with responses is supported,\n the minimum allowed number of buffers is 1.\n\n No reports for a new advertising event containing chained PDUs will be\n enqueued until the host has emptied the previous event's buffers.\n\n Default: SDC_DEFAULT_PERIODIC_SYNC_BUFFER_COUNT."]
    pub periodic_sync_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = "Configures the size of the periodic advertiser list.\n\n The maximum number of supported devices is 8.\n\n Default: SDC_DEFAULT_PERIODIC_ADV_LIST_SIZE."]
    pub periodic_adv_list_size: u8,
    #[doc = "Configures the maximum number of concurrent periodic advertising sets with responses.\n\n Default: SDC_DEFAULT_PERIODIC_ADV_RSP_COUNT."]
    pub periodic_adv_rsp_count: sdc_cfg_role_count_t,
    #[doc = "Configures the number and size of the data buffers available per periodic advertising set with responses.\n Default: See sdc_cfg_periodic_adv_rsp_buffer_cfg_t."]
    pub periodic_adv_rsp_buffer_cfg: sdc_cfg_periodic_adv_rsp_buffer_cfg_t,
    #[doc = "Enables/disables failure response reports for Periodic Advertising with Responses - Advertiser.\n\n Set to 1 to enable RX failure reporting, 0 to disable.\n\n Default: disabled."]
    pub periodic_adv_rsp_failure_reporting_cfg: u8,
    #[doc = "Configures the maximum number of responses that can be stored in the controller\n when synchronized to a periodic advertiser with responses.\n\n The minimum number of buffers is 1.\n\n Default: SDC_DEFAULT_PERIODIC_SYNC_RSP_TX_BUFFER_COUNT."]
    pub periodic_sync_rsp_tx_buffer_cfg: sdc_cfg_buffer_count_t,
    #[doc = "Configures the maximum number of concurrent CIGs.\n\n Default: SDC_DEFAULT_CIG_COUNT."]
    pub cig_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of concurrent CISs.\n\n Default: SDC_DEFAULT_CIS_COUNT."]
    pub cis_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of concurrent BIGs.\n\n Default: SDC_DEFAULT_BIG_COUNT."]
    pub big_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of concurrent sink BISs.\n\n Default: SDC_DEFAULT_BIS_SINK_COUNT."]
    pub bis_sink_count: sdc_cfg_role_count_t,
    #[doc = "Configures the maximum number of concurrent source BISs.\n\n Default: SDC_DEFAULT_BIS_SOURCE_COUNT."]
    pub bis_source_count: sdc_cfg_role_count_t,
    #[doc = "Configures the number and size of buffers allocated for ISO.\n\n Default: See sdc_cfg_iso_buffer_cfg_t."]
    pub iso_buffer_cfg: sdc_cfg_iso_buffer_cfg_t,
    #[doc = "Configures the maximum number of concurrent connections supporting CS procedure.\n\n Default: SDC_DEFAULT_CS_COUNT."]
    pub cs_count: sdc_cfg_role_count_t,
    #[doc = "Configures the capabilities enabled in the Channel Sounding feature.\n\n Default: See sdc_cfg_cs_cfg_t."]
    pub cs_cfg: sdc_cfg_cs_cfg_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_cfg_t"][::core::mem::size_of::<sdc_cfg_t>() - 10usize];
    ["Alignment of sdc_cfg_t"][::core::mem::align_of::<sdc_cfg_t>() - 2usize];
    ["Offset of field: sdc_cfg_t::central_count"][::core::mem::offset_of!(sdc_cfg_t, central_count) - 0usize];
    ["Offset of field: sdc_cfg_t::peripheral_count"][::core::mem::offset_of!(sdc_cfg_t, peripheral_count) - 0usize];
    ["Offset of field: sdc_cfg_t::buffer_cfg"][::core::mem::offset_of!(sdc_cfg_t, buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::adv_count"][::core::mem::offset_of!(sdc_cfg_t, adv_count) - 0usize];
    ["Offset of field: sdc_cfg_t::scan_buffer_cfg"][::core::mem::offset_of!(sdc_cfg_t, scan_buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::adv_buffer_cfg"][::core::mem::offset_of!(sdc_cfg_t, adv_buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::fal_size"][::core::mem::offset_of!(sdc_cfg_t, fal_size) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_adv_count"][::core::mem::offset_of!(sdc_cfg_t, periodic_adv_count) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_sync_count"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_sync_count) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_sync_buffer_cfg"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_sync_buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_adv_list_size"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_adv_list_size) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_adv_rsp_count"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_adv_rsp_count) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_adv_rsp_buffer_cfg"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_adv_rsp_buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_adv_rsp_failure_reporting_cfg"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_adv_rsp_failure_reporting_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::periodic_sync_rsp_tx_buffer_cfg"]
        [::core::mem::offset_of!(sdc_cfg_t, periodic_sync_rsp_tx_buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::cig_count"][::core::mem::offset_of!(sdc_cfg_t, cig_count) - 0usize];
    ["Offset of field: sdc_cfg_t::cis_count"][::core::mem::offset_of!(sdc_cfg_t, cis_count) - 0usize];
    ["Offset of field: sdc_cfg_t::big_count"][::core::mem::offset_of!(sdc_cfg_t, big_count) - 0usize];
    ["Offset of field: sdc_cfg_t::bis_sink_count"][::core::mem::offset_of!(sdc_cfg_t, bis_sink_count) - 0usize];
    ["Offset of field: sdc_cfg_t::bis_source_count"][::core::mem::offset_of!(sdc_cfg_t, bis_source_count) - 0usize];
    ["Offset of field: sdc_cfg_t::iso_buffer_cfg"][::core::mem::offset_of!(sdc_cfg_t, iso_buffer_cfg) - 0usize];
    ["Offset of field: sdc_cfg_t::cs_count"][::core::mem::offset_of!(sdc_cfg_t, cs_count) - 0usize];
    ["Offset of field: sdc_cfg_t::cs_cfg"][::core::mem::offset_of!(sdc_cfg_t, cs_cfg) - 0usize];
};
unsafe extern "C" {
    #[doc = "Initialize the SoftDevice Controller\n\n After this function is called, the application may use SoC APIs.\n\n # Arguments\n\n* `[in]` -fault_handler The fault handler will be executed when there is an\n internal error in the SoftDevice Controller.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EINVAL` - Invalid argument provided\n * `-NRF_EPERM` - Unable to initialize because\n - MPSL is not initialized\n - MPSL needs to be configured with a LFCLK accuracy\n of 500 ppm or better."]
    pub fn sdc_init(fault_handler: sdc_fault_handler_t) -> i32;
}
unsafe extern "C" {
    #[doc = "Change or add a SoftDevice Controller configuration\n\n To change the default configuration, update SDC_DEFAULT_RESOURCE_CFG_TAG. To create or update a new\n configuration, provide another resource_cfg_tag.\n\n > **Note:** The application can set config_type to SDC_CFG_TYPE_NONE to obtain the required memory size for the\n current configuration in bytes.\n\n > **Note:** Resource configuration can only be performed prior to calling sdc_enable(). However, the current configuration may be\n changed after enabling the SoftDevice Controller.\n\n # Arguments\n\n* `[in]` -config_tag Configuration tag.\n * `[in]` -config_type Configuration type. See also sdc_cfg_type.\n * `[in]` -p_resource_cfg Configuration to be changed.\n\n # Returns\n\nRequired memory size for the current configuration in bytes.\n * `-NRF_EOPNOTSUPP` - Unsupported configuration.\n * `-NRF_ENOMEM` - Configuration required over 64 kB of RAM that is\nnot supported currently.\n * `-NRF_EINVAL` - Invalid argument provided.\n * `-NRF_EPERM` - This API was called after sdc_enable()."]
    pub fn sdc_cfg_set(config_tag: u8, config_type: u8, p_resource_cfg: *const sdc_cfg_t) -> i32;
}
unsafe extern "C" {
    #[doc = "Enable the SoftDevice Controller\n\n After this function is called, the application may utilize HCI APIs.\n\n # Arguments\n\n* `[in]` -callback The callback will be executed when HCI data or and HCI\n event is available. The callback will be executed in\n the same context as mpsl_low_priority_process.\n See also sdc_hci_get().\n * `[in]` -p_mem Provide memory for the current resource configuration.\n To obtain the required memory size, use the value\n returned from sdc_cfg_set().\n The pointer must be 8 bytes aligned.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EINVAL` - Invalid argument provided\n * `-NRF_EPERM` - The entropy source is not configured. Call sdc_rand_source_register() first."]
    pub fn sdc_enable(callback: sdc_callback_t, p_mem: *mut u8) -> i32;
}
unsafe extern "C" {
    #[doc = "Disable the SoftDevice Controller\n\n This call is synchronous. After the SoftDevice Controller is disabled, Bluetooth LE\n functionality is no longer available.\n\n # Returns\n\n* `0` - Success"]
    pub fn sdc_disable() -> i32;
}
unsafe extern "C" {
    #[doc = "Obtain build revision string\n\n The application must provide a buffer that is at least SDC_BUILD_REVISION_SIZE\n bytes long. The SoftDevice Controller will copy the build revision string to the provided buffer.\n\n # Arguments\n\n* `[in,out]` -p_build_revision Build revision.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EINVAL` - Invalid argument provided"]
    pub fn sdc_build_revision_get(p_build_revision: *mut u8) -> i32;
}
unsafe extern "C" {
    #[doc = "Support Advertising State\n\n After this API is called, the controller will support the HCI commands\n and events related to the Advertising State.\n Only non-connectable advertising is supported. To support connectable\n advertising, call sdc_support_peripheral().\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Advertising state is not supported."]
    pub fn sdc_support_adv() -> i32;
}
unsafe extern "C" {
    #[doc = "Support extended advertising\n\n After this API is called, the controller will support the HCI commands\n and events related to both legacy and extended advertising.\n\n To reduce the size of the final linked image, the application should\n call either sdc_support_adv() or sdc_support_ext_adv().\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Extended advertising state is not supported."]
    pub fn sdc_support_ext_adv() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Peripheral role\n\n After this API is called, the controller will support the HCI commands\n and events related to the peripheral role.\n\n The application shall call either sdc_support_adv() or\n sdc_support_ext_adv() to be able to support connection\n establishment.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Peripheral role is not supported."]
    pub fn sdc_support_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Scanning state\n\n After this API is called, the controller will support the HCI commands\n and events related to the scanning state.\n\n To reduce the size of the final linked image, the application should\n not call both sdc_support_scan() and sdc_support_ext_scan().\n\n This API shall not be called together with\n sdc_support_central() or sdc_support_ext_central().\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Scanning state is not supported."]
    pub fn sdc_support_scan() -> i32;
}
unsafe extern "C" {
    #[doc = "Support scanning for extended advertising PDUs\n\n After this API is called, the controller will support the HCI commands\n and events related to both legacy and extended scanning.\n\n To reduce the size of the final linked image, the application should\n not call both sdc_support_scan() and sdc_support_ext_scan().\n\n This API shall not be called together with\n sdc_support_central() or sdc_support_ext_central().\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Extended scanning state is not supported."]
    pub fn sdc_support_ext_scan() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Scanner, Initiator, and Central role\n\n After this API is called, the controller will support the HCI commands\n and events related to the scanner, initiator, and central role.\n\n To reduce the size of the final linked image, the application should\n not call both sdc_support_central() and sdc_support_ext_central().\n\n This API shall not be called together with\n sdc_support_scan() or sdc_support_ext_scan().\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - These features are not supported."]
    pub fn sdc_support_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Extended Scanner, Extended Initiator, and Central role\n\n After this API is called, the controller will support the HCI commands\n and events related to the extended scanner, initiator, and central role.\n\n To reduce the size of the final linked image, the application should\n not call both sdc_support_central() and sdc_support_ext_central().\n\n This API shall not be called together with\n sdc_support_scan() or sdc_support_ext_scan().\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - These features are not supported."]
    pub fn sdc_support_ext_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support for scanning and initiating at the same time.\n\n After this API is called, the controller will support:\n - Creating a connection while passive or active scanning is enabled\n - Enabling passive or active scanning while a connection attempt is ongoing\n\n This API should be called only when centrals are supported (the application should\n call either sdc_support_central() or sdc_support_ext_central()).\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Scanning and initiating in parallel is not supported."]
    pub fn sdc_support_parallel_scanning_and_initiating() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Power Class 1\n\n After this API is called, the controller will include LE Power Class 1 in the supported features.\n\n > **Note:** The controller only adds this feature bit, the user will have to know whether this is required.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable()."]
    pub fn sdc_support_le_power_class_1() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Data Length Extensions for a central device\n\n After this API is called, the controller will support data length extension in the central role.\n That is:\n - DLE is marked supported in the LL Feature Exchange procedure.\n - All DLE HCI APIs are supported. The controller replies with LL_LENGTH_RSP\n when a LL_LENGTH_REQ is received.\n\n > **Note:** The application is required to call both sdc_support_dle_central() and sdc_support_dle_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Data Length Extension or Central Role is not supported."]
    pub fn sdc_support_dle_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Data Length Extensions for a peripheral device\n\n After this API is called, the controller will support data length extension in the peripheral role.\n That is:\n - DLE is marked supported in the LL Feature Exchange procedure.\n - All DLE HCI APIs are supported. The controller replies with LL_LENGTH_RSP\n when a LL_LENGTH_REQ is received.\n\n > **Note:** The application is required to call both sdc_support_dle_central() and sdc_support_dle_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Data Length Extension or Peripheral Role is not supported."]
    pub fn sdc_support_dle_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE 2M PHY\n\n After this API is called, the controller will support LE 2M PHY. That is:\n - The controller can use 2M PHY in both the connected and non-connected state.\n - LE 2M PHY is marked supported in the LL Feature Exchange procedure.\n\n > **Note:** The application is required to call sdc_support_phy_update_central() and/or sdc_support_phy_update_peripheral()\n to enable the PHY update procedure.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable()."]
    pub fn sdc_support_le_2m_phy() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Coded PHY\n\n After this API is called, the controller will support LE Coded PHY. That is:\n - The controller can use LE Coded PHY in both the connected and non-connected state.\n - LE Coded PHY is marked supported in the LL Feature Exchange procedure.\n\n > **Note:** The application is required to call sdc_support_phy_update_central() and/or sdc_support_phy_update_peripheral()\n to enable the PHY update procedure.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Coded PHY is not supported."]
    pub fn sdc_support_le_coded_phy() -> i32;
}
unsafe extern "C" {
    #[doc = "Support PHY Update Procedure for central role\n\n After this API is called, the controller will support PHY update procedure in central role. That is:\n - All HCI APIs for obtaining or changing PHYs are supported for central role.\n\n > **Note:** The application is required to call both sdc_support_phy_update_central() and sdc_support_phy_update_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Coded PHY is not supported."]
    pub fn sdc_support_phy_update_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Coded PHY for peripheral role\n\n After this API is called, the controller will support PHY update procedure in peripheral role. That is:\n - All HCI APIs for obtaining or changing PHYs are supported for peripheral role.\n\n > **Note:** The application is required to call both sdc_support_phy_update_central() and sdc_support_phy_update_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Coded PHY is not supported."]
    pub fn sdc_support_phy_update_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Periodic Advertising in the Advertising state\n\n After this API is called, the controller will support the HCI commands\n related to the Periodic Advertising State.\n\n The application shall also call sdc_support_ext_adv() to enable\n support for extended advertising before enabling support for periodic advertising.\n\n > **Note:** This API also enables support for ADI in periodic advertising packets.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Periodic advertising is not supported."]
    pub fn sdc_support_le_periodic_adv() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Periodic Advertising in the Synchronization state\n\n After this API is called, the controller will support the HCI commands\n related to the Synchronization State.\n\n The application shall also call sdc_support_ext_scan() to enable\n support for scanning for periodic advertisers before enabling support for\n this feature.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Periodic advertising is not supported."]
    pub fn sdc_support_le_periodic_sync() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Periodic Advertising with Responses in the Advertising state\n\n After this API is called, the controller will support the HCI commands\n related to Periodic Advertising with Responses.\n\n The application shall also call sdc_support_ext_adv(), sdc_support_le_periodic_adv(),\n and at least one of sdc_support_periodic_adv_sync_transfer_sender_central()\n and sdc_support_periodic_adv_sync_transfer_sender_peripheral()\n to enable support for the extended advertising, periodic advertising,\n and sync transfer sender features before enabling support for\n Periodic Advertising with Responses.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Periodic Advertising with Responses is not supported."]
    pub fn sdc_support_le_periodic_adv_with_rsp() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Periodic Advertising with Responses in the Synchronization state\n\n After this API is called, the controller will support the HCI commands\n related to Periodic Sync with Responses.\n\n The application shall also call sdc_support_ext_adv(), sdc_support_le_periodic_sync(),\n and at least one of sdc_support_periodic_adv_sync_transfer_receiver_central and\n sdc_support_periodic_adv_sync_transfer_receiver_peripheral to enable support for extended\n advertising, periodic advertising, and the sync transfer receiver features before enabling\n support for Periodic Sync with Responses.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Periodic Sync with Responses is not supported."]
    pub fn sdc_support_le_periodic_sync_with_rsp() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Power Control for central role\n\n After this API is called, the controller will support the HCI commands\n related to LE Power Control.\n\n > **Note:** The application is required to call both sdc_support_le_power_control_central() and sdc_support_le_power_control_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Power Control is not supported."]
    pub fn sdc_support_le_power_control_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Power Control for peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to LE Power Control.\n\n > **Note:** The application is required to call both sdc_support_le_power_control_central() and sdc_support_le_power_control_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Power Control is not supported."]
    pub fn sdc_support_le_power_control_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Path Loss Monitoring\n\n After this API is called, the controller will support the HCI commands\n related to LE Path Loss Monitoring.\n\n > **Note:** The application is required to call at least one of sdc_support_le_power_control_central()\n and sdc_support_le_power_control_peripheral() before enabling support for LE Path Loss Monitoring.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Path Loss Monitoring is not supported."]
    pub fn sdc_support_le_path_loss_monitoring() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Sleep Clock Accuracy (SCA) Update procedure for central role\n\n > **Note:** The application is required to call both sdc_support_sca_central() and sdc_support_sca_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - SCA Update procedure is not supported."]
    pub fn sdc_support_sca_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Sleep Clock Accuracy (SCA) Update procedure for peripheral role\n\n > **Note:** The application is required to call both sdc_support_sca_central() and sdc_support_sca_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - SCA Update procedure is not supported."]
    pub fn sdc_support_sca_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Connection CTE response for central role\n\n After this API is called, the controller will support the HCI commands\n related to the LE Connection CTE Response.\n\n > **Note:** The application is required to call both sdc_support_le_conn_cte_rsp_central() and sdc_support_le_conn_cte_rsp_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Connection CTE Response is not supported."]
    pub fn sdc_support_le_conn_cte_rsp_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Connection CTE response for peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to the LE Connection CTE Response.\n\n > **Note:** The application is required to call both sdc_support_le_conn_cte_rsp_central() and sdc_support_le_conn_cte_rsp_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - LE Connection CTE Response is not supported."]
    pub fn sdc_support_le_conn_cte_rsp_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support for sending periodic advertising sync transfers as central role\n\n > **Note:** The application is required to call both sdc_support_periodic_adv_sync_transfer_sender_central()\n and sdc_support_periodic_adv_sync_transfer_sender_peripheral() if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Sending periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_sender_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support for sending periodic advertising sync transfers as peripheral role\n\n > **Note:** The application is required to call both sdc_support_periodic_adv_sync_transfer_sender_central()\n and sdc_support_periodic_adv_sync_transfer_sender_peripheral() if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Sending periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_sender_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support for receiving periodic advertising sync transfers as central role\n\n > **Note:** The application is required to call both sdc_support_periodic_adv_sync_transfer_receiver_central()\n and sdc_support_periodic_adv_sync_transfer_receiver_peripheral() if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Receiving periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_receiver_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support for receiving periodic advertising sync transfers as peripheral role\n\n > **Note:** The application is required to call both sdc_support_periodic_adv_sync_transfer_receiver_central()\n and sdc_support_periodic_adv_sync_transfer_receiver_peripheral() if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Receiving periodic advertising sync transfers is not supported."]
    pub fn sdc_support_periodic_adv_sync_transfer_receiver_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Connected Isochronous streams in the peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to Connected Isochronous channels in the peripheral role\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Connected Isochronous streams in the peripheral role is not supported."]
    pub fn sdc_support_cis_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Connected Isochronous streams in the central role\n\n After this API is called, the controller will support the HCI commands\n related to Connected Isochronous channels in the central role\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Connected Isochronous streams in the central role is not supported."]
    pub fn sdc_support_cis_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Broadcast Isochronous streams as a source\n\n After this API is called, the controller will support the HCI commands\n related to Broadcast Isochronous channels as a source\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Broadcast Isochronous streams as a source is not supported."]
    pub fn sdc_support_bis_source() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Broadcast Isochronous streams as a sink\n\n After this API is called, the controller will support the HCI commands\n related to Broadcast Isochronous channels as a sink\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Broadcast Isochronous streams as a sink is not supported."]
    pub fn sdc_support_bis_sink() -> i32;
}
unsafe extern "C" {
    #[doc = "Configure the controller to ignore HCI ISO data timestamps from the host\n\n The controller requires that timestamps coming from the host/application are based on the controller's clock.\n This option can instruct the controller to ignore the timestamps, if the host sends timestamps that are not based on the controller's clock.\n\n # Arguments\n\n* `ignore` - indicates if timestamps in HCI ISO data packets from the host should be ignored.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EOPNOTSUPP` - Broadcast Isochronous streams as source and Connected Isochronous Channels are not supported."]
    pub fn sdc_iso_host_timestamps_ignore(ignore: bool) -> i32;
}
unsafe extern "C" {
    #[doc = "Support for Quality of Service (QoS) channel survey module\n\n After this API is called, the controller will support the sdc_hci_cmd_vs_qos_channel_survey_enable HCI command\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - QoS channel survey is not supported."]
    pub fn sdc_support_qos_channel_survey() -> i32;
}
unsafe extern "C" {
    #[doc = "Support for setting the default radio TX power level\n\n This API sets the default power level for radio TX activity in the controller.\n\n The power level set will be equal to or less than the one requested, based on the values\n supported by the hardware used. Values outside the suported range will be set to the nearest\n supported value.\n\n `requested_power_level` represents the actual power level fed to the antenna.\n When a Front-End Module is used, gain values for the SoC and FEM are calculated\n automatically to guarantee the closest possible match to the value requested by the user\n at the RF output.\n\n # Arguments\n\n* `[in]` -requested_power_level The power level in dBm to use.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_enable()."]
    pub fn sdc_default_tx_power_set(requested_power_level: i8) -> i32;
}
unsafe extern "C" {
    #[doc = "Support Connection Subrating for central role\n\n After this API is called, the controller will support the HCI commands\n related to Connection Subrating.\n\n > **Note:** The application is required to call both sdc_support_connection_subrating_central() and sdc_support_connection_subrating_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Connection Subrating is not supported."]
    pub fn sdc_support_connection_subrating_central() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Connection Subrating for peripheral role\n\n After this API is called, the controller will support the HCI commands\n related to Connection Subrating.\n\n > **Note:** The application is required to call both sdc_support_connection_subrating_central() and sdc_support_connection_subrating_peripheral()\n if both central and peripheral roles are supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Connection Subrating is not supported."]
    pub fn sdc_support_connection_subrating_peripheral() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Channel Sounding test command\n\n After this API is called, the controller will support the HCI command\n HCI LE Channel Sounding Test\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Channel Sounding Test is not supported"]
    pub fn sdc_support_channel_sounding_test() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Channel Sounding Step Mode 3\n\n After this API is called, the controller will support Channel Sounding Step Mode 3\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Channel Sounding is not supported"]
    pub fn sdc_support_channel_sounding_mode3() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Channel Sounding Initiator role\n\n After this API is called, the controller will support Channel Sounding Initiator role\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Channel Sounding is not supported"]
    pub fn sdc_support_channel_sounding_initiator_role() -> i32;
}
unsafe extern "C" {
    #[doc = "Support Channel Sounding Reflector role\n\n After this API is called, the controller will support Channel Sounding Reflector role\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Channel Sounding is not supported"]
    pub fn sdc_support_channel_sounding_reflector_role() -> i32;
}
unsafe extern "C" {
    #[doc = "Support LE Channel Sounding\n\n After this API is called, the controller will support the HCI commands\n related to Channel Sounding.\n\n The application shall call sdc_support_channel_sounding_test() to enable\n support for Channel Sounding test command.\n\n # Arguments\n\n* `[in]` -antenna_switch_cb Antenna Switching callback used to control an antennna switch\n in the case of a multiantenna application. May be NULL if no\n antenna switching is needed. See\n sdc_cfg_cs_cfg_t::num_antennas_supported.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EPERM` - This API must be called before sdc_cfg_set() or sdc_enable().\n * `-NRF_EOPNOTSUPP` - Channel Sounding is not supported"]
    pub fn sdc_support_channel_sounding(antenna_switch_cb: sdc_cs_antenna_switch_callback_t) -> i32;
}
pub const SDC_HCI_MSG_TYPE_NONE: sdc_hci_msg_type_t = 0;
pub const SDC_HCI_MSG_TYPE_DATA: sdc_hci_msg_type_t = 2;
pub const SDC_HCI_MSG_TYPE_EVT: sdc_hci_msg_type_t = 4;
pub const SDC_HCI_MSG_TYPE_ISO: sdc_hci_msg_type_t = 8;
pub type sdc_hci_msg_type_t = ::core::ffi::c_uint;
unsafe extern "C" {
    #[doc = "Send an HCI data packet to the SoftDevice Controller.\n\n # Arguments\n\n* `[in]` -p_data_in HCI Data packet. The first byte in the buffer should correspond to\n Handle, as specified by the Bluetooth Core Specification.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EINVAL` - Invalid input"]
    pub fn sdc_hci_data_put(p_data_in: *const u8) -> i32;
}
unsafe extern "C" {
    #[doc = "Send an HCI ISO data packet to the SoftDevice Controller.\n\n If an error is returned, the HCI ISO data packet is dropped by the SoftDevice Controller and will not be\n further processed.\n\n # Arguments\n\n* `[in]` -p_data_in HCI Data packet. The first byte in the buffer should correspond to\n Handle, as specified by the Bluetooth Core Specification.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EINVAL` - Invalid input\n * `-NRF_EPERM` - There is no data-path for the selected Handle\n * `-NRF_EAGAIN` - The data is provided too late\n * `-NRF_EFAULT` - Failure during processing of the data"]
    pub fn sdc_hci_iso_data_put(p_data_in: *const u8) -> i32;
}
unsafe extern "C" {
    #[doc = "Retrieve an HCI packet from the SoftDevice Controller.\n\n This API is non-blocking.\n\n > **Note:** The application should ensure that the size of the provided buffer is at least\n HCI_MSG_BUFFER_MAX_SIZE bytes.\n For Isochronous Channels the provided buffer should be large enough to contain the maximum supported SDU size.\n See also sdc_cfg_iso_buffer_cfg_t::rx_sdu_buffer_size and HCI_ISO_DATA_PACKET_MAX_SIZE.\n\n # Arguments\n\n* `[in,out]` -p_packet_out Buffer where the HCI packet will be stored.\n If an event is retrieved, the first byte corresponds to the Event Code.\n If a data packet is retrieved, the first byte corresponds to the Handle.\n * `[out]` -p_msg_type_out Type of HCI packet produced by the controller.\n See sdc_hci_msg_type_t for possible values.\n\n # Returns\n\n* `0` - Success\n * `-NRF_EAGAIN` - No event available\n * `-NRF_EINVAL` - Invalid input"]
    pub fn sdc_hci_get(p_packet_out: *mut u8, p_msg_type_out: *mut u8) -> i32;
}
#[doc = "See sdc_hci_cmd_cb_set_event_mask()."]
pub const SDC_HCI_OPCODE_CMD_CB_SET_EVENT_MASK: sdc_hci_opcode_cb = 3073;
#[doc = "See sdc_hci_cmd_cb_reset()."]
pub const SDC_HCI_OPCODE_CMD_CB_RESET: sdc_hci_opcode_cb = 3075;
#[doc = "See sdc_hci_cmd_cb_read_conn_accept_timeout()."]
pub const SDC_HCI_OPCODE_CMD_CB_READ_CONN_ACCEPT_TIMEOUT: sdc_hci_opcode_cb = 3093;
#[doc = "See sdc_hci_cmd_cb_write_conn_accept_timeout()."]
pub const SDC_HCI_OPCODE_CMD_CB_WRITE_CONN_ACCEPT_TIMEOUT: sdc_hci_opcode_cb = 3094;
#[doc = "See sdc_hci_cmd_cb_read_transmit_power_level()."]
pub const SDC_HCI_OPCODE_CMD_CB_READ_TRANSMIT_POWER_LEVEL: sdc_hci_opcode_cb = 3117;
#[doc = "See sdc_hci_cmd_cb_set_controller_to_host_flow_control()."]
pub const SDC_HCI_OPCODE_CMD_CB_SET_CONTROLLER_TO_HOST_FLOW_CONTROL: sdc_hci_opcode_cb = 3121;
#[doc = "See sdc_hci_cmd_cb_host_buffer_size()."]
pub const SDC_HCI_OPCODE_CMD_CB_HOST_BUFFER_SIZE: sdc_hci_opcode_cb = 3123;
#[doc = "See sdc_hci_cmd_cb_host_number_of_completed_packets()."]
pub const SDC_HCI_OPCODE_CMD_CB_HOST_NUMBER_OF_COMPLETED_PACKETS: sdc_hci_opcode_cb = 3125;
#[doc = "See sdc_hci_cmd_cb_set_event_mask_page_2()."]
pub const SDC_HCI_OPCODE_CMD_CB_SET_EVENT_MASK_PAGE_2: sdc_hci_opcode_cb = 3171;
#[doc = "See sdc_hci_cmd_cb_read_authenticated_payload_timeout()."]
pub const SDC_HCI_OPCODE_CMD_CB_READ_AUTHENTICATED_PAYLOAD_TIMEOUT: sdc_hci_opcode_cb = 3195;
#[doc = "See sdc_hci_cmd_cb_write_authenticated_payload_timeout()."]
pub const SDC_HCI_OPCODE_CMD_CB_WRITE_AUTHENTICATED_PAYLOAD_TIMEOUT: sdc_hci_opcode_cb = 3196;
#[doc = "HCI CB OpCode Field values."]
pub type sdc_hci_opcode_cb = ::core::ffi::c_uint;
#[doc = "Event Mask.\n\n If the bit in the Event_Mask is set to a one,\n then the event associated with that bit will be enabled."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cb_event_mask_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 7usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cb_event_mask_t"][::core::mem::size_of::<sdc_hci_cb_event_mask_t>() - 7usize];
    ["Alignment of sdc_hci_cb_event_mask_t"][::core::mem::align_of::<sdc_hci_cb_event_mask_t>() - 1usize];
};
impl sdc_hci_cb_event_mask_t {
    #[inline]
    pub fn inquiry_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn inquiry_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_inquiry_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn inquiry_result_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_result_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn inquiry_result_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_inquiry_result_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn connection_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connection_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connection_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_connection_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn connection_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connection_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connection_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_connection_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn disconnection_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_disconnection_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn disconnection_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_disconnection_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn authentication_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_authentication_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn authentication_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_authentication_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn remote_name_request_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_name_request_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn remote_name_request_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_remote_name_request_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn encryption_change_event_v1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption_change_event_v1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn encryption_change_event_v1_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_encryption_change_event_v1_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn change_connection_link_key_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_change_connection_link_key_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn change_connection_link_key_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_change_connection_link_key_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link_key_type_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_key_type_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_key_type_changed_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_link_key_type_changed_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn read_remote_supported_features_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_remote_supported_features_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn read_remote_supported_features_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_read_remote_supported_features_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn read_remote_version_information_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_remote_version_information_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn read_remote_version_information_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_read_remote_version_information_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn qos_setup_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_qos_setup_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn qos_setup_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_qos_setup_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hardware_error_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hardware_error_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hardware_error_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hardware_error_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flush_occurred_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flush_occurred_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flush_occurred_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_flush_occurred_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn role_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_role_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn role_change_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_role_change_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn mode_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_mode_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn mode_change_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_mode_change_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn return_link_keys_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_return_link_keys_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn return_link_keys_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_return_link_keys_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn pin_code_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pin_code_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pin_code_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_pin_code_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link_key_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_key_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_key_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_link_key_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link_key_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_key_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_key_notification_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_link_key_notification_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn loopback_command_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_loopback_command_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn loopback_command_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_loopback_command_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn data_buffer_overflow_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_data_buffer_overflow_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn data_buffer_overflow_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_data_buffer_overflow_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn max_slots_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_max_slots_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn max_slots_change_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_max_slots_change_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn read_clock_offset_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_clock_offset_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn read_clock_offset_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_read_clock_offset_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn connection_packet_type_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connection_packet_type_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connection_packet_type_changed_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_connection_packet_type_changed_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn qos_violation_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_qos_violation_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn qos_violation_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                26usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_qos_violation_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                26usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used30(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used30(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used30_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                27usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used30_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                27usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn page_scan_repetition_mode_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_page_scan_repetition_mode_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn page_scan_repetition_mode_change_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_page_scan_repetition_mode_change_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flow_specification_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_flow_specification_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flow_specification_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_flow_specification_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn inquiry_result_with_rssi_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_result_with_rssi_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn inquiry_result_with_rssi_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_inquiry_result_with_rssi_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn read_remote_extended_features_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_read_remote_extended_features_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn read_remote_extended_features_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_read_remote_extended_features_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn synchronous_connection_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronous_connection_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn synchronous_connection_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_synchronous_connection_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn synchronous_connection_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(33usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronous_connection_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(33usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn synchronous_connection_changed_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                33usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_synchronous_connection_changed_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                33usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sniff_subrating_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(34usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sniff_subrating_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(34usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sniff_subrating_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                34usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sniff_subrating_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                34usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn extended_inquiry_result_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_extended_inquiry_result_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn extended_inquiry_result_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                35usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_extended_inquiry_result_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                35usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn encryption_key_refresh_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption_key_refresh_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn encryption_key_refresh_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                36usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_encryption_key_refresh_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                36usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn io_capability_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(37usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_io_capability_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(37usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn io_capability_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                37usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_io_capability_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                37usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn io_capability_response_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(38usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_io_capability_response_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(38usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn io_capability_response_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                38usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_io_capability_response_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                38usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn user_confirmation_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(39usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_user_confirmation_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(39usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn user_confirmation_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                39usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_user_confirmation_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                39usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn user_passkey_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_user_passkey_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn user_passkey_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                40usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_user_passkey_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn remote_oob_data_request_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(41usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_oob_data_request_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(41usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn remote_oob_data_request_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                41usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_remote_oob_data_request_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                41usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn simple_pairing_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(42usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_simple_pairing_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(42usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn simple_pairing_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                42usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_simple_pairing_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                42usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn link_supervision_timeout_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(43usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_link_supervision_timeout_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(43usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn link_supervision_timeout_changed_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                43usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_link_supervision_timeout_changed_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                43usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_flush_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_flush_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_flush_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                44usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_flush_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                44usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn user_passkey_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(45usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_user_passkey_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(45usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn user_passkey_notification_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                45usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_user_passkey_notification_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                45usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn keypress_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(46usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_keypress_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(46usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn keypress_notification_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                46usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_keypress_notification_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                46usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn remote_host_supported_features_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_remote_host_supported_features_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn remote_host_supported_features_notification_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                47usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_remote_host_supported_features_notification_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                47usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn le_meta_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_le_meta_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn le_meta_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 7usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                48usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_le_meta_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 7usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        inquiry_complete_event: u8,
        inquiry_result_event: u8,
        connection_complete_event: u8,
        connection_request_event: u8,
        disconnection_complete_event: u8,
        authentication_complete_event: u8,
        remote_name_request_complete_event: u8,
        encryption_change_event_v1: u8,
        change_connection_link_key_complete_event: u8,
        link_key_type_changed_event: u8,
        read_remote_supported_features_complete_event: u8,
        read_remote_version_information_complete_event: u8,
        qos_setup_complete_event: u8,
        hardware_error_event: u8,
        flush_occurred_event: u8,
        role_change_event: u8,
        mode_change_event: u8,
        return_link_keys_event: u8,
        pin_code_request_event: u8,
        link_key_request_event: u8,
        link_key_notification_event: u8,
        loopback_command_event: u8,
        data_buffer_overflow_event: u8,
        max_slots_change_event: u8,
        read_clock_offset_complete_event: u8,
        connection_packet_type_changed_event: u8,
        qos_violation_event: u8,
        previously_used30: u8,
        page_scan_repetition_mode_change_event: u8,
        flow_specification_complete_event: u8,
        inquiry_result_with_rssi_event: u8,
        read_remote_extended_features_complete_event: u8,
        synchronous_connection_complete_event: u8,
        synchronous_connection_changed_event: u8,
        sniff_subrating_event: u8,
        extended_inquiry_result_event: u8,
        encryption_key_refresh_complete_event: u8,
        io_capability_request_event: u8,
        io_capability_response_event: u8,
        user_confirmation_request_event: u8,
        user_passkey_request_event: u8,
        remote_oob_data_request_event: u8,
        simple_pairing_complete_event: u8,
        link_supervision_timeout_changed_event: u8,
        enhanced_flush_complete_event: u8,
        user_passkey_notification_event: u8,
        keypress_notification_event: u8,
        remote_host_supported_features_notification_event: u8,
        le_meta_event: u8,
    ) -> __BindgenBitfieldUnit<[u8; 7usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 7usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let inquiry_complete_event: u8 = unsafe { ::core::mem::transmute(inquiry_complete_event) };
            inquiry_complete_event as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let inquiry_result_event: u8 = unsafe { ::core::mem::transmute(inquiry_result_event) };
            inquiry_result_event as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let connection_complete_event: u8 = unsafe { ::core::mem::transmute(connection_complete_event) };
            connection_complete_event as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let connection_request_event: u8 = unsafe { ::core::mem::transmute(connection_request_event) };
            connection_request_event as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let disconnection_complete_event: u8 = unsafe { ::core::mem::transmute(disconnection_complete_event) };
            disconnection_complete_event as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let authentication_complete_event: u8 = unsafe { ::core::mem::transmute(authentication_complete_event) };
            authentication_complete_event as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let remote_name_request_complete_event: u8 =
                unsafe { ::core::mem::transmute(remote_name_request_complete_event) };
            remote_name_request_complete_event as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let encryption_change_event_v1: u8 = unsafe { ::core::mem::transmute(encryption_change_event_v1) };
            encryption_change_event_v1 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let change_connection_link_key_complete_event: u8 =
                unsafe { ::core::mem::transmute(change_connection_link_key_complete_event) };
            change_connection_link_key_complete_event as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let link_key_type_changed_event: u8 = unsafe { ::core::mem::transmute(link_key_type_changed_event) };
            link_key_type_changed_event as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let read_remote_supported_features_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_remote_supported_features_complete_event) };
            read_remote_supported_features_complete_event as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let read_remote_version_information_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_remote_version_information_complete_event) };
            read_remote_version_information_complete_event as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let qos_setup_complete_event: u8 = unsafe { ::core::mem::transmute(qos_setup_complete_event) };
            qos_setup_complete_event as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let hardware_error_event: u8 = unsafe { ::core::mem::transmute(hardware_error_event) };
            hardware_error_event as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let flush_occurred_event: u8 = unsafe { ::core::mem::transmute(flush_occurred_event) };
            flush_occurred_event as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let role_change_event: u8 = unsafe { ::core::mem::transmute(role_change_event) };
            role_change_event as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let mode_change_event: u8 = unsafe { ::core::mem::transmute(mode_change_event) };
            mode_change_event as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let return_link_keys_event: u8 = unsafe { ::core::mem::transmute(return_link_keys_event) };
            return_link_keys_event as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let pin_code_request_event: u8 = unsafe { ::core::mem::transmute(pin_code_request_event) };
            pin_code_request_event as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let link_key_request_event: u8 = unsafe { ::core::mem::transmute(link_key_request_event) };
            link_key_request_event as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let link_key_notification_event: u8 = unsafe { ::core::mem::transmute(link_key_notification_event) };
            link_key_notification_event as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let loopback_command_event: u8 = unsafe { ::core::mem::transmute(loopback_command_event) };
            loopback_command_event as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let data_buffer_overflow_event: u8 = unsafe { ::core::mem::transmute(data_buffer_overflow_event) };
            data_buffer_overflow_event as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let max_slots_change_event: u8 = unsafe { ::core::mem::transmute(max_slots_change_event) };
            max_slots_change_event as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let read_clock_offset_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_clock_offset_complete_event) };
            read_clock_offset_complete_event as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let connection_packet_type_changed_event: u8 =
                unsafe { ::core::mem::transmute(connection_packet_type_changed_event) };
            connection_packet_type_changed_event as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let qos_violation_event: u8 = unsafe { ::core::mem::transmute(qos_violation_event) };
            qos_violation_event as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let previously_used30: u8 = unsafe { ::core::mem::transmute(previously_used30) };
            previously_used30 as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let page_scan_repetition_mode_change_event: u8 =
                unsafe { ::core::mem::transmute(page_scan_repetition_mode_change_event) };
            page_scan_repetition_mode_change_event as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let flow_specification_complete_event: u8 =
                unsafe { ::core::mem::transmute(flow_specification_complete_event) };
            flow_specification_complete_event as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let inquiry_result_with_rssi_event: u8 = unsafe { ::core::mem::transmute(inquiry_result_with_rssi_event) };
            inquiry_result_with_rssi_event as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let read_remote_extended_features_complete_event: u8 =
                unsafe { ::core::mem::transmute(read_remote_extended_features_complete_event) };
            read_remote_extended_features_complete_event as u64
        });
        __bindgen_bitfield_unit.set(32usize, 1u8, {
            let synchronous_connection_complete_event: u8 =
                unsafe { ::core::mem::transmute(synchronous_connection_complete_event) };
            synchronous_connection_complete_event as u64
        });
        __bindgen_bitfield_unit.set(33usize, 1u8, {
            let synchronous_connection_changed_event: u8 =
                unsafe { ::core::mem::transmute(synchronous_connection_changed_event) };
            synchronous_connection_changed_event as u64
        });
        __bindgen_bitfield_unit.set(34usize, 1u8, {
            let sniff_subrating_event: u8 = unsafe { ::core::mem::transmute(sniff_subrating_event) };
            sniff_subrating_event as u64
        });
        __bindgen_bitfield_unit.set(35usize, 1u8, {
            let extended_inquiry_result_event: u8 = unsafe { ::core::mem::transmute(extended_inquiry_result_event) };
            extended_inquiry_result_event as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let encryption_key_refresh_complete_event: u8 =
                unsafe { ::core::mem::transmute(encryption_key_refresh_complete_event) };
            encryption_key_refresh_complete_event as u64
        });
        __bindgen_bitfield_unit.set(37usize, 1u8, {
            let io_capability_request_event: u8 = unsafe { ::core::mem::transmute(io_capability_request_event) };
            io_capability_request_event as u64
        });
        __bindgen_bitfield_unit.set(38usize, 1u8, {
            let io_capability_response_event: u8 = unsafe { ::core::mem::transmute(io_capability_response_event) };
            io_capability_response_event as u64
        });
        __bindgen_bitfield_unit.set(39usize, 1u8, {
            let user_confirmation_request_event: u8 =
                unsafe { ::core::mem::transmute(user_confirmation_request_event) };
            user_confirmation_request_event as u64
        });
        __bindgen_bitfield_unit.set(40usize, 1u8, {
            let user_passkey_request_event: u8 = unsafe { ::core::mem::transmute(user_passkey_request_event) };
            user_passkey_request_event as u64
        });
        __bindgen_bitfield_unit.set(41usize, 1u8, {
            let remote_oob_data_request_event: u8 = unsafe { ::core::mem::transmute(remote_oob_data_request_event) };
            remote_oob_data_request_event as u64
        });
        __bindgen_bitfield_unit.set(42usize, 1u8, {
            let simple_pairing_complete_event: u8 = unsafe { ::core::mem::transmute(simple_pairing_complete_event) };
            simple_pairing_complete_event as u64
        });
        __bindgen_bitfield_unit.set(43usize, 1u8, {
            let link_supervision_timeout_changed_event: u8 =
                unsafe { ::core::mem::transmute(link_supervision_timeout_changed_event) };
            link_supervision_timeout_changed_event as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let enhanced_flush_complete_event: u8 = unsafe { ::core::mem::transmute(enhanced_flush_complete_event) };
            enhanced_flush_complete_event as u64
        });
        __bindgen_bitfield_unit.set(45usize, 1u8, {
            let user_passkey_notification_event: u8 =
                unsafe { ::core::mem::transmute(user_passkey_notification_event) };
            user_passkey_notification_event as u64
        });
        __bindgen_bitfield_unit.set(46usize, 1u8, {
            let keypress_notification_event: u8 = unsafe { ::core::mem::transmute(keypress_notification_event) };
            keypress_notification_event as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let remote_host_supported_features_notification_event: u8 =
                unsafe { ::core::mem::transmute(remote_host_supported_features_notification_event) };
            remote_host_supported_features_notification_event as u64
        });
        __bindgen_bitfield_unit.set(48usize, 1u8, {
            let le_meta_event: u8 = unsafe { ::core::mem::transmute(le_meta_event) };
            le_meta_event as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Event mask page 2.\n\n If the bit in the Event_Mask is set to a one,\n then the event associated with that bit will be enabled."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cb_event_mask_page_2_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cb_event_mask_page_2_t"][::core::mem::size_of::<sdc_hci_cb_event_mask_page_2_t>() - 4usize];
    ["Alignment of sdc_hci_cb_event_mask_page_2_t"][::core::mem::align_of::<sdc_hci_cb_event_mask_page_2_t>() - 1usize];
};
impl sdc_hci_cb_event_mask_page_2_t {
    #[inline]
    pub fn previously_used0(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used0(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used0_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used0_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used1_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used1_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used2_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used2_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used3_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used3_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used4_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used4_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used5_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used5_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used6_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used6_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used7_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used7_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn number_of_completed_data_blocks_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_number_of_completed_data_blocks_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn number_of_completed_data_blocks_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_number_of_completed_data_blocks_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used9(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used9(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used9_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used9_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used10(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used10(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used10_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used10_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used11(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used11(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used11_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used11_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used12(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used12(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used12_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used12_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used13(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used13(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used13_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used13_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn triggered_clock_capture_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_triggered_clock_capture_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn triggered_clock_capture_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_triggered_clock_capture_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn synchronization_train_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronization_train_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn synchronization_train_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_synchronization_train_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn synchronization_train_received_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_synchronization_train_received_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn synchronization_train_received_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_synchronization_train_received_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn connectionless_peripheral_broadcast_receive_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connectionless_peripheral_broadcast_receive_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connectionless_peripheral_broadcast_receive_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_connectionless_peripheral_broadcast_receive_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn connectionless_peripheral_broadcast_timeout_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connectionless_peripheral_broadcast_timeout_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connectionless_peripheral_broadcast_timeout_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_connectionless_peripheral_broadcast_timeout_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn truncated_page_complete_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_truncated_page_complete_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn truncated_page_complete_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_truncated_page_complete_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn peripheral_page_response_timeout_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_peripheral_page_response_timeout_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn peripheral_page_response_timeout_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_peripheral_page_response_timeout_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn connectionless_peripheral_broadcast_channel_map_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(21usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_connectionless_peripheral_broadcast_channel_map_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(21usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn connectionless_peripheral_broadcast_channel_map_change_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                21usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_connectionless_peripheral_broadcast_channel_map_change_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                21usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn inquiry_response_notification_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(22usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_inquiry_response_notification_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(22usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn inquiry_response_notification_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                22usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_inquiry_response_notification_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                22usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn authenticated_payload_timeout_expired_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_authenticated_payload_timeout_expired_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn authenticated_payload_timeout_expired_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_authenticated_payload_timeout_expired_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sam_status_change_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sam_status_change_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sam_status_change_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sam_status_change_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn encryption_change_event_v2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption_change_event_v2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn encryption_change_event_v2_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_encryption_change_event_v2_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        previously_used0: u8,
        previously_used1: u8,
        previously_used2: u8,
        previously_used3: u8,
        previously_used4: u8,
        previously_used5: u8,
        previously_used6: u8,
        previously_used7: u8,
        number_of_completed_data_blocks_event: u8,
        previously_used9: u8,
        previously_used10: u8,
        previously_used11: u8,
        previously_used12: u8,
        previously_used13: u8,
        triggered_clock_capture_event: u8,
        synchronization_train_complete_event: u8,
        synchronization_train_received_event: u8,
        connectionless_peripheral_broadcast_receive_event: u8,
        connectionless_peripheral_broadcast_timeout_event: u8,
        truncated_page_complete_event: u8,
        peripheral_page_response_timeout_event: u8,
        connectionless_peripheral_broadcast_channel_map_change_event: u8,
        inquiry_response_notification_event: u8,
        authenticated_payload_timeout_expired_event: u8,
        sam_status_change_event: u8,
        encryption_change_event_v2: u8,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let previously_used0: u8 = unsafe { ::core::mem::transmute(previously_used0) };
            previously_used0 as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let previously_used1: u8 = unsafe { ::core::mem::transmute(previously_used1) };
            previously_used1 as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let previously_used2: u8 = unsafe { ::core::mem::transmute(previously_used2) };
            previously_used2 as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let previously_used3: u8 = unsafe { ::core::mem::transmute(previously_used3) };
            previously_used3 as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let previously_used4: u8 = unsafe { ::core::mem::transmute(previously_used4) };
            previously_used4 as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let previously_used5: u8 = unsafe { ::core::mem::transmute(previously_used5) };
            previously_used5 as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let previously_used6: u8 = unsafe { ::core::mem::transmute(previously_used6) };
            previously_used6 as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let previously_used7: u8 = unsafe { ::core::mem::transmute(previously_used7) };
            previously_used7 as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let number_of_completed_data_blocks_event: u8 =
                unsafe { ::core::mem::transmute(number_of_completed_data_blocks_event) };
            number_of_completed_data_blocks_event as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let previously_used9: u8 = unsafe { ::core::mem::transmute(previously_used9) };
            previously_used9 as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let previously_used10: u8 = unsafe { ::core::mem::transmute(previously_used10) };
            previously_used10 as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let previously_used11: u8 = unsafe { ::core::mem::transmute(previously_used11) };
            previously_used11 as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let previously_used12: u8 = unsafe { ::core::mem::transmute(previously_used12) };
            previously_used12 as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let previously_used13: u8 = unsafe { ::core::mem::transmute(previously_used13) };
            previously_used13 as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let triggered_clock_capture_event: u8 = unsafe { ::core::mem::transmute(triggered_clock_capture_event) };
            triggered_clock_capture_event as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let synchronization_train_complete_event: u8 =
                unsafe { ::core::mem::transmute(synchronization_train_complete_event) };
            synchronization_train_complete_event as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let synchronization_train_received_event: u8 =
                unsafe { ::core::mem::transmute(synchronization_train_received_event) };
            synchronization_train_received_event as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let connectionless_peripheral_broadcast_receive_event: u8 =
                unsafe { ::core::mem::transmute(connectionless_peripheral_broadcast_receive_event) };
            connectionless_peripheral_broadcast_receive_event as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let connectionless_peripheral_broadcast_timeout_event: u8 =
                unsafe { ::core::mem::transmute(connectionless_peripheral_broadcast_timeout_event) };
            connectionless_peripheral_broadcast_timeout_event as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let truncated_page_complete_event: u8 = unsafe { ::core::mem::transmute(truncated_page_complete_event) };
            truncated_page_complete_event as u64
        });
        __bindgen_bitfield_unit.set(20usize, 1u8, {
            let peripheral_page_response_timeout_event: u8 =
                unsafe { ::core::mem::transmute(peripheral_page_response_timeout_event) };
            peripheral_page_response_timeout_event as u64
        });
        __bindgen_bitfield_unit.set(21usize, 1u8, {
            let connectionless_peripheral_broadcast_channel_map_change_event: u8 =
                unsafe { ::core::mem::transmute(connectionless_peripheral_broadcast_channel_map_change_event) };
            connectionless_peripheral_broadcast_channel_map_change_event as u64
        });
        __bindgen_bitfield_unit.set(22usize, 1u8, {
            let inquiry_response_notification_event: u8 =
                unsafe { ::core::mem::transmute(inquiry_response_notification_event) };
            inquiry_response_notification_event as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let authenticated_payload_timeout_expired_event: u8 =
                unsafe { ::core::mem::transmute(authenticated_payload_timeout_expired_event) };
            authenticated_payload_timeout_expired_event as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let sam_status_change_event: u8 = unsafe { ::core::mem::transmute(sam_status_change_event) };
            sam_status_change_event as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let encryption_change_event_v2: u8 = unsafe { ::core::mem::transmute(encryption_change_event_v2) };
            encryption_change_event_v2 as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Host Number Of Completed Packets array parameters."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cb_host_number_of_completed_packets_array_params_t {
    pub conn_handle: u16,
    pub host_num_completed_packets: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cb_host_number_of_completed_packets_array_params_t"]
        [::core::mem::size_of::<sdc_hci_cb_host_number_of_completed_packets_array_params_t>() - 4usize];
    ["Alignment of sdc_hci_cb_host_number_of_completed_packets_array_params_t"]
        [::core::mem::align_of::<sdc_hci_cb_host_number_of_completed_packets_array_params_t>() - 1usize];
    ["Offset of field: sdc_hci_cb_host_number_of_completed_packets_array_params_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cb_host_number_of_completed_packets_array_params_t, conn_handle) - 0usize];
    ["Offset of field: sdc_hci_cb_host_number_of_completed_packets_array_params_t::host_num_completed_packets"][::core::mem::offset_of!(
        sdc_hci_cb_host_number_of_completed_packets_array_params_t,
        host_num_completed_packets
    )
        - 2usize];
};
#[doc = "Set Event Mask command parameter(s)."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union sdc_hci_cmd_cb_set_event_mask_t {
    pub params: sdc_hci_cb_event_mask_t,
    pub raw: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_set_event_mask_t"][::core::mem::size_of::<sdc_hci_cmd_cb_set_event_mask_t>() - 8usize];
    ["Alignment of sdc_hci_cmd_cb_set_event_mask_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_set_event_mask_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_set_event_mask_t::params"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_set_event_mask_t, params) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_set_event_mask_t::raw"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_set_event_mask_t, raw) - 0usize];
};
#[doc = "Read Connection Accept Timeout return parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_conn_accept_timeout_return_t {
    pub conn_accept_timeout: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_read_conn_accept_timeout_return_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_read_conn_accept_timeout_return_t>() - 2usize];
    ["Alignment of sdc_hci_cmd_cb_read_conn_accept_timeout_return_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_read_conn_accept_timeout_return_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_read_conn_accept_timeout_return_t::conn_accept_timeout"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_conn_accept_timeout_return_t, conn_accept_timeout) - 0usize];
};
#[doc = "Write Connection Accept Timeout command parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_write_conn_accept_timeout_t {
    pub conn_accept_timeout: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_write_conn_accept_timeout_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_write_conn_accept_timeout_t>() - 2usize];
    ["Alignment of sdc_hci_cmd_cb_write_conn_accept_timeout_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_write_conn_accept_timeout_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_write_conn_accept_timeout_t::conn_accept_timeout"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_write_conn_accept_timeout_t, conn_accept_timeout) - 0usize];
};
#[doc = "Read Transmit Power Level command parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_transmit_power_level_t {
    pub conn_handle: u16,
    pub type_: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_read_transmit_power_level_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_read_transmit_power_level_t>() - 3usize];
    ["Alignment of sdc_hci_cmd_cb_read_transmit_power_level_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_read_transmit_power_level_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_read_transmit_power_level_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_transmit_power_level_t, conn_handle) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_read_transmit_power_level_t::type_"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_transmit_power_level_t, type_) - 2usize];
};
#[doc = "Read Transmit Power Level return parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_transmit_power_level_return_t {
    pub conn_handle: u16,
    pub tx_power_level: i8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_read_transmit_power_level_return_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_read_transmit_power_level_return_t>() - 3usize];
    ["Alignment of sdc_hci_cmd_cb_read_transmit_power_level_return_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_read_transmit_power_level_return_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_read_transmit_power_level_return_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_transmit_power_level_return_t, conn_handle) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_read_transmit_power_level_return_t::tx_power_level"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_transmit_power_level_return_t, tx_power_level) - 2usize];
};
#[doc = "Set Controller To Host Flow Control command parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_set_controller_to_host_flow_control_t {
    pub flow_control_enable: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_set_controller_to_host_flow_control_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_set_controller_to_host_flow_control_t>() - 1usize];
    ["Alignment of sdc_hci_cmd_cb_set_controller_to_host_flow_control_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_set_controller_to_host_flow_control_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_set_controller_to_host_flow_control_t::flow_control_enable"][::core::mem::offset_of!(
        sdc_hci_cmd_cb_set_controller_to_host_flow_control_t,
        flow_control_enable
    ) - 0usize];
};
#[doc = "Host Buffer Size command parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_host_buffer_size_t {
    pub host_acl_data_packet_length: u16,
    pub host_sync_data_packet_length: u8,
    pub host_total_num_acl_data_packets: u16,
    pub host_total_num_sync_data_packets: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_host_buffer_size_t"][::core::mem::size_of::<sdc_hci_cmd_cb_host_buffer_size_t>() - 7usize];
    ["Alignment of sdc_hci_cmd_cb_host_buffer_size_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_host_buffer_size_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_host_buffer_size_t::host_acl_data_packet_length"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_host_buffer_size_t, host_acl_data_packet_length) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_host_buffer_size_t::host_sync_data_packet_length"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_host_buffer_size_t, host_sync_data_packet_length) - 2usize];
    ["Offset of field: sdc_hci_cmd_cb_host_buffer_size_t::host_total_num_acl_data_packets"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_host_buffer_size_t, host_total_num_acl_data_packets) - 3usize];
    ["Offset of field: sdc_hci_cmd_cb_host_buffer_size_t::host_total_num_sync_data_packets"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_host_buffer_size_t, host_total_num_sync_data_packets) - 5usize];
};
#[doc = "Host Number Of Completed Packets command parameter(s)."]
#[repr(C, packed)]
pub struct sdc_hci_cmd_cb_host_number_of_completed_packets_t {
    pub num_handles: u8,
    pub array_params: __IncompleteArrayField<sdc_hci_cb_host_number_of_completed_packets_array_params_t>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_host_number_of_completed_packets_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_host_number_of_completed_packets_t>() - 1usize];
    ["Alignment of sdc_hci_cmd_cb_host_number_of_completed_packets_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_host_number_of_completed_packets_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_host_number_of_completed_packets_t::num_handles"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_host_number_of_completed_packets_t, num_handles) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_host_number_of_completed_packets_t::array_params"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_host_number_of_completed_packets_t, array_params) - 1usize];
};
#[doc = "Set Event Mask Page 2 command parameter(s)."]
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union sdc_hci_cmd_cb_set_event_mask_page_2_t {
    pub params: sdc_hci_cb_event_mask_page_2_t,
    pub raw: [u8; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_set_event_mask_page_2_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_set_event_mask_page_2_t>() - 8usize];
    ["Alignment of sdc_hci_cmd_cb_set_event_mask_page_2_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_set_event_mask_page_2_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_set_event_mask_page_2_t::params"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_set_event_mask_page_2_t, params) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_set_event_mask_page_2_t::raw"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_set_event_mask_page_2_t, raw) - 0usize];
};
#[doc = "Read Authenticated Payload Timeout command parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_authenticated_payload_timeout_t {
    pub conn_handle: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_read_authenticated_payload_timeout_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_t>() - 2usize];
    ["Alignment of sdc_hci_cmd_cb_read_authenticated_payload_timeout_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_read_authenticated_payload_timeout_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_t, conn_handle) - 0usize];
};
#[doc = "Read Authenticated Payload Timeout return parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t {
    pub conn_handle: u16,
    pub authenticated_payload_timeout: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t>() - 4usize];
    ["Alignment of sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t, conn_handle) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t::authenticated_payload_timeout"][::core::mem::offset_of!(
        sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t,
        authenticated_payload_timeout
    )
        - 2usize];
};
#[doc = "Write Authenticated Payload Timeout command parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_write_authenticated_payload_timeout_t {
    pub conn_handle: u16,
    pub authenticated_payload_timeout: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_write_authenticated_payload_timeout_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_t>() - 4usize];
    ["Alignment of sdc_hci_cmd_cb_write_authenticated_payload_timeout_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_write_authenticated_payload_timeout_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_t, conn_handle) - 0usize];
    ["Offset of field: sdc_hci_cmd_cb_write_authenticated_payload_timeout_t::authenticated_payload_timeout"][::core::mem::offset_of!(
        sdc_hci_cmd_cb_write_authenticated_payload_timeout_t,
        authenticated_payload_timeout
    )
        - 2usize];
};
#[doc = "Write Authenticated Payload Timeout return parameter(s)."]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t {
    pub conn_handle: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t"]
        [::core::mem::size_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t>() - 2usize];
    ["Alignment of sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t"]
        [::core::mem::align_of::<sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t>() - 1usize];
    ["Offset of field: sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t::conn_handle"]
        [::core::mem::offset_of!(sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t, conn_handle) - 0usize];
};
unsafe extern "C" {
    #[doc = "HCI_VS_API API\n # /\n/* Set Event Mask.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.1\n\n The HCI_Set_Event_Mask command is used to control which events are generated\n by the HCI for the Host. If the bit in the Event_Mask is set to a one, then the event\n associated with that bit will be enabled. For an LE Controller, the LE Meta event bit\n in the event_Mask shall enable or disable all LE events in the LE Meta event (see\n Section 7.7.65). The event mask allows the Host to control how much it is interrupted.\n\n The Controller shall ignore those bits which are reserved for future use or represent\n events which it does not support. If the Host sets any of these bits to 1, the Controller\n shall act as if they were set to 0.\n\n Event(s) generated (unless masked away):\n When the HCI_Set_Event_Mask command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_set_event_mask(p_params: *const sdc_hci_cmd_cb_set_event_mask_t) -> u8;
}
unsafe extern "C" {
    #[doc = "Reset.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.2\n\n The HCI_Reset command will reset the Controller and the Link Manager on the\n BR/EDR Controller or the Link Layer on an LE Controller. If the Controller supports both\n BR/EDR and LE then the HCI_Reset command shall reset the Link Manager, Baseband\n and Link Layer. The HCI_Reset command shall not affect the used HCI transport layer\n since the HCI transport layers may have reset mechanisms of their own. After the\n reset is completed, the current operational state will be lost, the Controller will enter\n standby mode and the Controller will automatically revert to the default values for the\n parameters for which default values are defined in the specification.\n\n Note: The HCI_Reset command will not necessarily perform a hardware reset. This is\n implementation defined.\n\n The Host shall not send additional HCI commands before the\n HCI_Command_Complete event related to the HCI_Reset command has been\n received.\n\n Event(s) generated (unless masked away):\n When the reset has been performed, an HCI_Command_Complete event shall be\n generated.\n\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_reset() -> u8;
}
unsafe extern "C" {
    #[doc = "Read Connection Accept Timeout.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.13\n\n This command reads the value for the Connection_Accept_Timeout configuration\n parameter. See Section 6.7.\n\n Event(s) generated (unless masked away):\n When the HCI_Read_Connection_Timeout command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[out]` -p_return Extra return parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_read_conn_accept_timeout(
        p_return: *mut sdc_hci_cmd_cb_read_conn_accept_timeout_return_t,
    ) -> u8;
}
unsafe extern "C" {
    #[doc = "Write Connection Accept Timeout.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.14\n\n This command writes the value for the Connection_Accept_Timeout configuration\n parameter. See Section 6.7.\n\n Event(s) generated (unless masked away):\n When the HCI_Write_Connection_Accept_Timeout command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_write_conn_accept_timeout(p_params: *const sdc_hci_cmd_cb_write_conn_accept_timeout_t) -> u8;
}
unsafe extern "C" {
    #[doc = "Read Transmit Power Level.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.35\n\n This command reads the values for the TX_Power_Level parameter for the specified\n Connection_Handle. The Connection_Handle shall be a Connection_Handle for an ACL\n connection.\n\n Event(s) generated (unless masked away):\n When the HCI_Read_Transmit_Power_Level command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n * `[out]` -p_return Extra return parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_read_transmit_power_level(
        p_params: *const sdc_hci_cmd_cb_read_transmit_power_level_t,
        p_return: *mut sdc_hci_cmd_cb_read_transmit_power_level_return_t,
    ) -> u8;
}
unsafe extern "C" {
    #[doc = "Set Controller To Host Flow Control.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.38\n\n This command is used by the Host to turn flow control on or off for data and/or\n voice sent in the direction from the Controller to the Host. If flow control is turned off,\n the Host should not send the HCI_Host_Number_Of_Completed_Packets command.\n That command will be ignored by the Controller if it is sent by the Host and flow\n control is off. If flow control is turned on for HCI ACL Data packets and off for HCI\n Synchronous Data packets, HCI_Host_Number_Of_Completed_Packets commands\n sent by the Host should only contain Connection_Handles for ACL connections. If\n flow control is turned off for HCI ACL Data packets and on for HCI Synchronous\n Data packets, HCI_Host_Number_Of_Completed_Packets commands sent by the Host\n should only contain Connection_Handles for synchronous connections. If flow control is\n turned on for HCI ACL Data packets and HCI Synchronous Data packets, the Host will\n send HCI_Host_Number_Of_Completed_Packets commands both for ACL connections\n and synchronous connections.\n\n The Flow_Control_Enable parameter shall only be changed if no connections exist.\n\n Event(s) generated (unless masked away):\n When the HCI_Set_Controller_To_Host_Flow_Control command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_set_controller_to_host_flow_control(
        p_params: *const sdc_hci_cmd_cb_set_controller_to_host_flow_control_t,
    ) -> u8;
}
unsafe extern "C" {
    #[doc = "Host Buffer Size.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.39\n\n The HCI_Host_Buffer_Size command is used by the Host to notify the Controller about\n the maximum size of the data portion of HCI ACL and Synchronous Data packets sent\n from the Controller to the Host. The Controller shall fragment the data to be transmitted\n from the Controller to the Host according to these sizes, so that the HCI Data packets\n will contain data with up to these sizes. The HCI_Host_Buffer_Size command also\n notifies the Controller about the total number of HCI ACL and Synchronous Data\n packets that can be stored in the data buffers of the Host. If flow control from the\n Controller to the Host is turned off, and the HCI_Host_Buffer_Size command has not\n been issued by the Host, this means that the Controller will send HCI Data packets\n to the Host with any lengths the Controller wants to use, and it is assumed that the\n data buffer sizes of the Host are unlimited. If flow control from the Controller to the\n Host is turned on, the HCI_Host_Buffer_Size command shall after a power-on or a reset\n always be sent by the Host before the first HCI_Host_Number_Of_Completed_Packets\n command is sent.\n\n The Set Controller To Host Flow Control command is used to turn flow control on or\n off. The Host_ACL_Data_Packet_Length parameter will be used to determine the size\n of the L2CAP fragments contained in ACL Data packets, which are transferred from\n the Controller to the Host. The Host_Synchronous_Data_Packet_Length parameter is\n used to determine the maximum size of HCI Synchronous Data packets. Both the Host\n and the Controller shall support command and event packets, where the data portion\n (excluding header) contained in the packets is 255 octets in size.\n\n The Host_Total_Num_ACL_Data_Packets parameter contains the total number of HCI\n ACL Data packets that can be stored in the data buffers of the Host. The Controller will\n determine how the buffers are to be divided between different Connection_Handles. The\n Host_Total_Num_Synchronous_Data_Packets parameter gives the same information\n for HCI Synchronous Data packets. If the Host does not support SCO or eSCO\n over HCI, then it shall set Host_Total_Num_Synchronous_Data_Packets to zero, in\n which case the Controller shall ignore the Host_Synchronous_Data_Packet_Length\n parameter.\n Note: The Host_ACL_Data_Packet_Length and\n Host_Synchronous_Data_Packet_Length command parameters do not include the\n length of the HCI ACL Data packet header or the HCI Synchronous Data packet header\n respectively.\n\n Event(s) generated (unless masked away):\n When the HCI_Host_Buffer_Size command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_host_buffer_size(p_params: *const sdc_hci_cmd_cb_host_buffer_size_t) -> u8;
}
unsafe extern "C" {
    #[doc = "Host Number Of Completed Packets.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.40\n\n The HCI_Host_Number_Of_Completed_Packets command is used by the\n Host to indicate to the Controller the number of HCI Data packets\n that have been completed for each Connection_Handle since the\n previous HCI_Host_Number_Of_Completed_Packets command was sent to\n the Controller. This means that the corresponding buffer space has\n been freed in the Host and is available for new packets to be\n sent. Based on this information, and the Host_Total_Num_ACL_Data_Packets\n and Host_Total_Num_Synchronous_Data_Packets command parameters of the\n HCI_Host_Buffer_Size command, the Controller can determine for which\n Connection_Handles the following HCI Data packets should be sent to the Host.\n When the Host has completed one or more HCI Data packet(s) it shall send an\n HCI_Host_Number_Of_Completed_Packets command to the Controller, until it finally\n reports that all pending HCI Data packets have been completed. The frequency at\n which this command is sent is manufacturer specific.\n\n The Set Controller To Host Flow Control command is used to turn flow control on or off.\n If flow control from the Controller to the Host is turned on, the HCI_Host_Buffer_Size\n command shall always be sent by the Host after a power-on or a reset before the first\n HCI_Host_Number_Of_Completed_Packets command is sent.\n\n The HCI_Host_Number_Of_Completed_Packets command may be sent at any time by\n the Host when there is at least one connection, or if the Controller is in local loopback\n mode, independent of other commands. If the Host issues this command when neither\n of these cases applies, the Controller shall ignore it.\n\n Event(s) generated (unless masked away):\n Normally, no event is generated after the HCI_Host_Number_Of_Completed_Packets\n command has completed. However, if the HCI_Host_Number_Of_Completed_Packets\n command contains one or more invalid parameters, the Controller shall return an\n HCI_Command_Complete event containing the error code Invalid HCI Command\n Parameters (0x12). The normal flow control for commands is not used for this\n command.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_host_number_of_completed_packets(
        p_params: *const sdc_hci_cmd_cb_host_number_of_completed_packets_t,
    ) -> u8;
}
unsafe extern "C" {
    #[doc = "Set Event Mask Page 2.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.69\n\n The HCI_Set_Event_Mask_Page_2 command is used to control which events are\n generated by the HCI for the Host. The Event_Mask_Page_2 is a logical extension\n to the Event_Mask parameter of the HCI_Set_Event_Mask command. If the bit in the\n Event_Mask_Page_2 is set to a one, then the event associated with that bit shall be\n enabled. The event mask allows the Host to control how much it is interrupted.\n\n The Controller shall ignore those bits which are reserved for future use or represent\n events which it does not support. If the Host sets any of these bits to 1, the Controller\n shall act as if they were set to 0.\n\n Event(s) generated (unless masked away):\n When the HCI_Set_Event_Mask_Page_2 command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_set_event_mask_page_2(p_params: *const sdc_hci_cmd_cb_set_event_mask_page_2_t) -> u8;
}
unsafe extern "C" {
    #[doc = "Read Authenticated Payload Timeout.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.93\n\n This command reads the Authenticated_Payload_Timeout (authenticatedPayloadTO,\n see 2] Part B, Appendix B for BR/EDR connections and 6] Part B, Section 5.4\n for LE connections) parameter in the Controller on the specified Connection_Handle.\n\n When the Connection_Handle identifies a BR/EDR synchronous connection or an LE\n BIS or CIS, the Controller shall return the error code Command Disallowed (0x0C).\n\n Event(s) generated (unless masked away):\n When the HCI_Read_Authenticated_Payload_Timeout command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n * `[out]` -p_return Extra return parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_read_authenticated_payload_timeout(
        p_params: *const sdc_hci_cmd_cb_read_authenticated_payload_timeout_t,
        p_return: *mut sdc_hci_cmd_cb_read_authenticated_payload_timeout_return_t,
    ) -> u8;
}
unsafe extern "C" {
    #[doc = "Write Authenticated Payload Timeout.\n\n The description below is extracted from Core_v6.0,\n Vol 4, Part E, Section 7.3.94\n\n This command writes the Authenticated_Payload_Timeout (authenticatedPayloadTO,\n see 2] Part B, Appendix B and 6] Part B, Section 5.4 for the LE connection)\n parameter in the Controller for the specified Connection_Handle.\n\n When the Connection_Handle identifies a BR/EDR ACL connection:\n\n  If the connection is in Sniff mode, the Authenticated_Payload_Timeout shall be equal\n to or greater than Tsniff.\n  If the connection is in Sniff Subrating mode, the Authenticated_Payload_Timeout shall\n be equal to or greater than\n (max subrate)xTsniff.\n  If the connection is in Hold mode, the Authenticated_Payload_Timeout shall be equal\n to or greater than the holdTO value.\n\n When the Connection_Handle identifies an LE ACL connection, the\n Authenticated_Payload_Timeout shall be equal to or greater than connInterval \n connSubrateFactor  (1 + connPeripheralLatency).\n\n When the Connection_Handle is associated with a BR/EDR ACL connection, the Link\n Manager will use this parameter to determine when to use the LMP ping sequence.\n\n When the Connection_Handle is associated with an LE ACL connection, the Link Layer\n will use this parameter to determine when to use the LE ping sequence.\n\n When the Connection_Handle identifies a BR/EDR synchronous connection or an LE\n BIS or CIS, this command shall be rejected with the error code Command Disallowed\n (0x0C).\n\n Event(s) generated (unless masked away):\n When the HCI_Write_Authenticated_Payload_Timeout command has completed, an\n HCI_Command_Complete event shall be generated.\n\n # Arguments\n\n* `[in]` -p_params Input parameters.\n * `[out]` -p_return Extra return parameters.\n\n # Returns\n\n* `0` - if success.\n Returns value between 0x01-0xFF in case of error.\n See Vol 2, Part D, Error for a list of error codes and descriptions."]
    pub fn sdc_hci_cmd_cb_write_authenticated_payload_timeout(
        p_params: *const sdc_hci_cmd_cb_write_authenticated_payload_timeout_t,
        p_return: *mut sdc_hci_cmd_cb_write_authenticated_payload_timeout_return_t,
    ) -> u8;
}
#[doc = "See sdc_hci_cmd_ip_read_local_version_information()."]
pub const SDC_HCI_OPCODE_CMD_IP_READ_LOCAL_VERSION_INFORMATION: sdc_hci_opcode_ip = 4097;
#[doc = "See sdc_hci_cmd_ip_read_local_supported_commands()."]
pub const SDC_HCI_OPCODE_CMD_IP_READ_LOCAL_SUPPORTED_COMMANDS: sdc_hci_opcode_ip = 4098;
#[doc = "See sdc_hci_cmd_ip_read_local_supported_features()."]
pub const SDC_HCI_OPCODE_CMD_IP_READ_LOCAL_SUPPORTED_FEATURES: sdc_hci_opcode_ip = 4099;
#[doc = "See sdc_hci_cmd_ip_read_bd_addr()."]
pub const SDC_HCI_OPCODE_CMD_IP_READ_BD_ADDR: sdc_hci_opcode_ip = 4105;
#[doc = "HCI IP OpCode Field values."]
pub type sdc_hci_opcode_ip = ::core::ffi::c_uint;
#[doc = "LMP features.\n\n See Core_v5.4, Vol 2, Part C, Section 3.3"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_ip_lmp_features_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_ip_lmp_features_t"][::core::mem::size_of::<sdc_hci_ip_lmp_features_t>() - 8usize];
    ["Alignment of sdc_hci_ip_lmp_features_t"][::core::mem::align_of::<sdc_hci_ip_lmp_features_t>() - 1usize];
};
impl sdc_hci_ip_lmp_features_t {
    #[inline]
    pub fn slot3_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot3_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot3_packets_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot3_packets_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn slot5_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot5_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot5_packets_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot5_packets_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn encryption_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_encryption_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn slot_offset(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot_offset(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot_offset_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot_offset_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn timing_accuracy(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_timing_accuracy(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn timing_accuracy_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_timing_accuracy_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn role_switch(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_role_switch(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn role_switch_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_role_switch_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hold_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hold_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hold_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hold_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sniff_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sniff_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sniff_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sniff_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn power_control_requests(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_power_control_requests(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn power_control_requests_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_power_control_requests_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn cqddr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_cqddr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn cqddr_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_cqddr_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sco_link(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sco_link(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sco_link_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sco_link_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hv2_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hv2_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hv2_packets_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hv2_packets_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hv3_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hv3_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hv3_packets_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hv3_packets_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn u_law_log_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_u_law_log_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn u_law_log_sync_data_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_u_law_log_sync_data_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn a_law_log_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_a_law_log_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn a_law_log_sync_data_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_a_law_log_sync_data_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn cvsd_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_cvsd_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn cvsd_sync_data_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_cvsd_sync_data_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn paging_param_negiotiation(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_paging_param_negiotiation(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn paging_param_negiotiation_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_paging_param_negiotiation_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn power_control(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_power_control(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn power_control_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_power_control_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn transparent_sync_data(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_transparent_sync_data(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn transparent_sync_data_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_transparent_sync_data_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn flow_control_lag(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 3u8) as u8) }
    }
    #[inline]
    pub fn set_flow_control_lag(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn flow_control_lag_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                3u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_flow_control_lag_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn broadcast_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(23usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_broadcast_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(23usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn broadcast_encryption_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                23usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_broadcast_encryption_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                23usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu1(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(24usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu1(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(24usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu1_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                24usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu1_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                24usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_data_rate_acl_2mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(25usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_acl_2mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(25usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_data_rate_acl_2mbps_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                25usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_data_rate_acl_2mbps_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                25usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_data_rate_acl_3mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(26usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_acl_3mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(26usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_data_rate_acl_3mbps_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                26usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_data_rate_acl_3mbps_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                26usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_inquiry_scan(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(27usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_inquiry_scan(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(27usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_inquiry_scan_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                27usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_inquiry_scan_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                27usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn interlaced_inquiry_scan(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(28usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_interlaced_inquiry_scan(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(28usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn interlaced_inquiry_scan_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                28usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_interlaced_inquiry_scan_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                28usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn interlaced_page_scan(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(29usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_interlaced_page_scan(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(29usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn interlaced_page_scan_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                29usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_interlaced_page_scan_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                29usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rssi_with_inquiry_results(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(30usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rssi_with_inquiry_results(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(30usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rssi_with_inquiry_results_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                30usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rssi_with_inquiry_results_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                30usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ext_sco_link(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(31usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ext_sco_link(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(31usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ext_sco_link_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                31usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ext_sco_link_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                31usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ev4_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(32usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ev4_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(32usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ev4_packets_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                32usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ev4_packets_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                32usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ev5_packets(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(33usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ev5_packets(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(33usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ev5_packets_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                33usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ev5_packets_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                33usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu2(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(34usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu2(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(34usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu2_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                34usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu2_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                34usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn afh_capable_peripheral(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(35usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_capable_peripheral(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(35usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn afh_capable_peripheral_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                35usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_afh_capable_peripheral_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                35usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn afh_classification_peripheral(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(36usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_classification_peripheral(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(36usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn afh_classification_peripheral_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                36usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_afh_classification_peripheral_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                36usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bdedr_not_supported(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(37usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_bdedr_not_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(37usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bdedr_not_supported_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                37usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_bdedr_not_supported_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                37usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn le_supported(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(38usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_le_supported(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(38usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn le_supported_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                38usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_le_supported_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                38usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn slot3_enhanced_data_rate(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(39usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot3_enhanced_data_rate(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(39usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot3_enhanced_data_rate_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                39usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot3_enhanced_data_rate_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                39usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn slot5_enhanced_data_rate(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(40usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot5_enhanced_data_rate(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(40usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot5_enhanced_data_rate_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                40usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot5_enhanced_data_rate_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                40usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn sniff_subrating(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(41usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_sniff_subrating(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(41usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn sniff_subrating_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                41usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_sniff_subrating_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                41usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn pause_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(42usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_pause_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(42usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn pause_encryption_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                42usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_pause_encryption_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                42usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn afh_capable_central(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(43usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_capable_central(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(43usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn afh_capable_central_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                43usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_afh_capable_central_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                43usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn afh_classification_central(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(44usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_afh_classification_central(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(44usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn afh_classification_central_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                44usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_afh_classification_central_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                44usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_data_rate_esco_2mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(45usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_esco_2mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(45usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_data_rate_esco_2mbps_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                45usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_data_rate_esco_2mbps_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                45usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_data_rate_esco_3mbps_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(46usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_data_rate_esco_3mbps_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(46usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_data_rate_esco_3mbps_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                46usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_data_rate_esco_3mbps_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                46usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn slot3_enhanced_data_rate_esco(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(47usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_slot3_enhanced_data_rate_esco(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(47usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn slot3_enhanced_data_rate_esco_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                47usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_slot3_enhanced_data_rate_esco_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                47usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ext_inquiry_response(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(48usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ext_inquiry_response(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(48usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ext_inquiry_response_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                48usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ext_inquiry_response_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                48usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn simultanious_le_and_bdedr(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(49usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_simultanious_le_and_bdedr(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(49usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn simultanious_le_and_bdedr_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                49usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_simultanious_le_and_bdedr_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                49usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu3(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(50usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu3(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(50usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu3_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                50usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu3_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                50usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn secure_simple_pairing(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(51usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_secure_simple_pairing(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(51usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn secure_simple_pairing_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                51usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_secure_simple_pairing_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                51usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn encapsulated_pdu(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(52usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_encapsulated_pdu(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(52usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn encapsulated_pdu_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                52usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_encapsulated_pdu_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                52usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn errorneous_data_reporting(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(53usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_errorneous_data_reporting(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(53usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn errorneous_data_reporting_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                53usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_errorneous_data_reporting_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                53usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn non_flushable_packet_boundary(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(54usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_non_flushable_packet_boundary(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(54usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn non_flushable_packet_boundary_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                54usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_non_flushable_packet_boundary_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                54usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu4(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(55usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu4(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(55usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu4_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                55usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu4_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                55usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_link_supervision_timeout_changed_event(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(56usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_supervision_timeout_changed_event(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(56usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_link_supervision_timeout_changed_event_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                56usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_link_supervision_timeout_changed_event_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                56usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn variable_inquiry_tx_power_level(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(57usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_variable_inquiry_tx_power_level(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(57usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn variable_inquiry_tx_power_level_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                57usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_variable_inquiry_tx_power_level_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                57usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn enhanced_power_control(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(58usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_enhanced_power_control(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(58usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn enhanced_power_control_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                58usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_enhanced_power_control_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                58usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu5(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(59usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu5(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(59usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu5_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                59usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu5_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                59usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(60usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(60usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu6_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                60usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu6_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                60usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu7(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(61usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu7(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(61usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu7_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                61usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu7_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                61usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn rfu8(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(62usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_rfu8(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(62usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn rfu8_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                62usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_rfu8_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                62usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn ext_features(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(63usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_ext_features(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(63usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn ext_features_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                63usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_ext_features_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                63usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        slot3_packets: u8,
        slot5_packets: u8,
        encryption: u8,
        slot_offset: u8,
        timing_accuracy: u8,
        role_switch: u8,
        hold_mode: u8,
        sniff_mode: u8,
        previously_used: u8,
        power_control_requests: u8,
        cqddr: u8,
        sco_link: u8,
        hv2_packets: u8,
        hv3_packets: u8,
        u_law_log_sync_data: u8,
        a_law_log_sync_data: u8,
        cvsd_sync_data: u8,
        paging_param_negiotiation: u8,
        power_control: u8,
        transparent_sync_data: u8,
        flow_control_lag: u8,
        broadcast_encryption: u8,
        rfu1: u8,
        enhanced_data_rate_acl_2mbps_mode: u8,
        enhanced_data_rate_acl_3mbps_mode: u8,
        enhanced_inquiry_scan: u8,
        interlaced_inquiry_scan: u8,
        interlaced_page_scan: u8,
        rssi_with_inquiry_results: u8,
        ext_sco_link: u8,
        ev4_packets: u8,
        ev5_packets: u8,
        rfu2: u8,
        afh_capable_peripheral: u8,
        afh_classification_peripheral: u8,
        bdedr_not_supported: u8,
        le_supported: u8,
        slot3_enhanced_data_rate: u8,
        slot5_enhanced_data_rate: u8,
        sniff_subrating: u8,
        pause_encryption: u8,
        afh_capable_central: u8,
        afh_classification_central: u8,
        enhanced_data_rate_esco_2mbps_mode: u8,
        enhanced_data_rate_esco_3mbps_mode: u8,
        slot3_enhanced_data_rate_esco: u8,
        ext_inquiry_response: u8,
        simultanious_le_and_bdedr: u8,
        rfu3: u8,
        secure_simple_pairing: u8,
        encapsulated_pdu: u8,
        errorneous_data_reporting: u8,
        non_flushable_packet_boundary: u8,
        rfu4: u8,
        hci_link_supervision_timeout_changed_event: u8,
        variable_inquiry_tx_power_level: u8,
        enhanced_power_control: u8,
        rfu5: u8,
        rfu6: u8,
        rfu7: u8,
        rfu8: u8,
        ext_features: u8,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let slot3_packets: u8 = unsafe { ::core::mem::transmute(slot3_packets) };
            slot3_packets as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let slot5_packets: u8 = unsafe { ::core::mem::transmute(slot5_packets) };
            slot5_packets as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let encryption: u8 = unsafe { ::core::mem::transmute(encryption) };
            encryption as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let slot_offset: u8 = unsafe { ::core::mem::transmute(slot_offset) };
            slot_offset as u64
        });
        __bindgen_bitfield_unit.set(4usize, 1u8, {
            let timing_accuracy: u8 = unsafe { ::core::mem::transmute(timing_accuracy) };
            timing_accuracy as u64
        });
        __bindgen_bitfield_unit.set(5usize, 1u8, {
            let role_switch: u8 = unsafe { ::core::mem::transmute(role_switch) };
            role_switch as u64
        });
        __bindgen_bitfield_unit.set(6usize, 1u8, {
            let hold_mode: u8 = unsafe { ::core::mem::transmute(hold_mode) };
            hold_mode as u64
        });
        __bindgen_bitfield_unit.set(7usize, 1u8, {
            let sniff_mode: u8 = unsafe { ::core::mem::transmute(sniff_mode) };
            sniff_mode as u64
        });
        __bindgen_bitfield_unit.set(8usize, 1u8, {
            let previously_used: u8 = unsafe { ::core::mem::transmute(previously_used) };
            previously_used as u64
        });
        __bindgen_bitfield_unit.set(9usize, 1u8, {
            let power_control_requests: u8 = unsafe { ::core::mem::transmute(power_control_requests) };
            power_control_requests as u64
        });
        __bindgen_bitfield_unit.set(10usize, 1u8, {
            let cqddr: u8 = unsafe { ::core::mem::transmute(cqddr) };
            cqddr as u64
        });
        __bindgen_bitfield_unit.set(11usize, 1u8, {
            let sco_link: u8 = unsafe { ::core::mem::transmute(sco_link) };
            sco_link as u64
        });
        __bindgen_bitfield_unit.set(12usize, 1u8, {
            let hv2_packets: u8 = unsafe { ::core::mem::transmute(hv2_packets) };
            hv2_packets as u64
        });
        __bindgen_bitfield_unit.set(13usize, 1u8, {
            let hv3_packets: u8 = unsafe { ::core::mem::transmute(hv3_packets) };
            hv3_packets as u64
        });
        __bindgen_bitfield_unit.set(14usize, 1u8, {
            let u_law_log_sync_data: u8 = unsafe { ::core::mem::transmute(u_law_log_sync_data) };
            u_law_log_sync_data as u64
        });
        __bindgen_bitfield_unit.set(15usize, 1u8, {
            let a_law_log_sync_data: u8 = unsafe { ::core::mem::transmute(a_law_log_sync_data) };
            a_law_log_sync_data as u64
        });
        __bindgen_bitfield_unit.set(16usize, 1u8, {
            let cvsd_sync_data: u8 = unsafe { ::core::mem::transmute(cvsd_sync_data) };
            cvsd_sync_data as u64
        });
        __bindgen_bitfield_unit.set(17usize, 1u8, {
            let paging_param_negiotiation: u8 = unsafe { ::core::mem::transmute(paging_param_negiotiation) };
            paging_param_negiotiation as u64
        });
        __bindgen_bitfield_unit.set(18usize, 1u8, {
            let power_control: u8 = unsafe { ::core::mem::transmute(power_control) };
            power_control as u64
        });
        __bindgen_bitfield_unit.set(19usize, 1u8, {
            let transparent_sync_data: u8 = unsafe { ::core::mem::transmute(transparent_sync_data) };
            transparent_sync_data as u64
        });
        __bindgen_bitfield_unit.set(20usize, 3u8, {
            let flow_control_lag: u8 = unsafe { ::core::mem::transmute(flow_control_lag) };
            flow_control_lag as u64
        });
        __bindgen_bitfield_unit.set(23usize, 1u8, {
            let broadcast_encryption: u8 = unsafe { ::core::mem::transmute(broadcast_encryption) };
            broadcast_encryption as u64
        });
        __bindgen_bitfield_unit.set(24usize, 1u8, {
            let rfu1: u8 = unsafe { ::core::mem::transmute(rfu1) };
            rfu1 as u64
        });
        __bindgen_bitfield_unit.set(25usize, 1u8, {
            let enhanced_data_rate_acl_2mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_acl_2mbps_mode) };
            enhanced_data_rate_acl_2mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(26usize, 1u8, {
            let enhanced_data_rate_acl_3mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_acl_3mbps_mode) };
            enhanced_data_rate_acl_3mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(27usize, 1u8, {
            let enhanced_inquiry_scan: u8 = unsafe { ::core::mem::transmute(enhanced_inquiry_scan) };
            enhanced_inquiry_scan as u64
        });
        __bindgen_bitfield_unit.set(28usize, 1u8, {
            let interlaced_inquiry_scan: u8 = unsafe { ::core::mem::transmute(interlaced_inquiry_scan) };
            interlaced_inquiry_scan as u64
        });
        __bindgen_bitfield_unit.set(29usize, 1u8, {
            let interlaced_page_scan: u8 = unsafe { ::core::mem::transmute(interlaced_page_scan) };
            interlaced_page_scan as u64
        });
        __bindgen_bitfield_unit.set(30usize, 1u8, {
            let rssi_with_inquiry_results: u8 = unsafe { ::core::mem::transmute(rssi_with_inquiry_results) };
            rssi_with_inquiry_results as u64
        });
        __bindgen_bitfield_unit.set(31usize, 1u8, {
            let ext_sco_link: u8 = unsafe { ::core::mem::transmute(ext_sco_link) };
            ext_sco_link as u64
        });
        __bindgen_bitfield_unit.set(32usize, 1u8, {
            let ev4_packets: u8 = unsafe { ::core::mem::transmute(ev4_packets) };
            ev4_packets as u64
        });
        __bindgen_bitfield_unit.set(33usize, 1u8, {
            let ev5_packets: u8 = unsafe { ::core::mem::transmute(ev5_packets) };
            ev5_packets as u64
        });
        __bindgen_bitfield_unit.set(34usize, 1u8, {
            let rfu2: u8 = unsafe { ::core::mem::transmute(rfu2) };
            rfu2 as u64
        });
        __bindgen_bitfield_unit.set(35usize, 1u8, {
            let afh_capable_peripheral: u8 = unsafe { ::core::mem::transmute(afh_capable_peripheral) };
            afh_capable_peripheral as u64
        });
        __bindgen_bitfield_unit.set(36usize, 1u8, {
            let afh_classification_peripheral: u8 = unsafe { ::core::mem::transmute(afh_classification_peripheral) };
            afh_classification_peripheral as u64
        });
        __bindgen_bitfield_unit.set(37usize, 1u8, {
            let bdedr_not_supported: u8 = unsafe { ::core::mem::transmute(bdedr_not_supported) };
            bdedr_not_supported as u64
        });
        __bindgen_bitfield_unit.set(38usize, 1u8, {
            let le_supported: u8 = unsafe { ::core::mem::transmute(le_supported) };
            le_supported as u64
        });
        __bindgen_bitfield_unit.set(39usize, 1u8, {
            let slot3_enhanced_data_rate: u8 = unsafe { ::core::mem::transmute(slot3_enhanced_data_rate) };
            slot3_enhanced_data_rate as u64
        });
        __bindgen_bitfield_unit.set(40usize, 1u8, {
            let slot5_enhanced_data_rate: u8 = unsafe { ::core::mem::transmute(slot5_enhanced_data_rate) };
            slot5_enhanced_data_rate as u64
        });
        __bindgen_bitfield_unit.set(41usize, 1u8, {
            let sniff_subrating: u8 = unsafe { ::core::mem::transmute(sniff_subrating) };
            sniff_subrating as u64
        });
        __bindgen_bitfield_unit.set(42usize, 1u8, {
            let pause_encryption: u8 = unsafe { ::core::mem::transmute(pause_encryption) };
            pause_encryption as u64
        });
        __bindgen_bitfield_unit.set(43usize, 1u8, {
            let afh_capable_central: u8 = unsafe { ::core::mem::transmute(afh_capable_central) };
            afh_capable_central as u64
        });
        __bindgen_bitfield_unit.set(44usize, 1u8, {
            let afh_classification_central: u8 = unsafe { ::core::mem::transmute(afh_classification_central) };
            afh_classification_central as u64
        });
        __bindgen_bitfield_unit.set(45usize, 1u8, {
            let enhanced_data_rate_esco_2mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_esco_2mbps_mode) };
            enhanced_data_rate_esco_2mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(46usize, 1u8, {
            let enhanced_data_rate_esco_3mbps_mode: u8 =
                unsafe { ::core::mem::transmute(enhanced_data_rate_esco_3mbps_mode) };
            enhanced_data_rate_esco_3mbps_mode as u64
        });
        __bindgen_bitfield_unit.set(47usize, 1u8, {
            let slot3_enhanced_data_rate_esco: u8 = unsafe { ::core::mem::transmute(slot3_enhanced_data_rate_esco) };
            slot3_enhanced_data_rate_esco as u64
        });
        __bindgen_bitfield_unit.set(48usize, 1u8, {
            let ext_inquiry_response: u8 = unsafe { ::core::mem::transmute(ext_inquiry_response) };
            ext_inquiry_response as u64
        });
        __bindgen_bitfield_unit.set(49usize, 1u8, {
            let simultanious_le_and_bdedr: u8 = unsafe { ::core::mem::transmute(simultanious_le_and_bdedr) };
            simultanious_le_and_bdedr as u64
        });
        __bindgen_bitfield_unit.set(50usize, 1u8, {
            let rfu3: u8 = unsafe { ::core::mem::transmute(rfu3) };
            rfu3 as u64
        });
        __bindgen_bitfield_unit.set(51usize, 1u8, {
            let secure_simple_pairing: u8 = unsafe { ::core::mem::transmute(secure_simple_pairing) };
            secure_simple_pairing as u64
        });
        __bindgen_bitfield_unit.set(52usize, 1u8, {
            let encapsulated_pdu: u8 = unsafe { ::core::mem::transmute(encapsulated_pdu) };
            encapsulated_pdu as u64
        });
        __bindgen_bitfield_unit.set(53usize, 1u8, {
            let errorneous_data_reporting: u8 = unsafe { ::core::mem::transmute(errorneous_data_reporting) };
            errorneous_data_reporting as u64
        });
        __bindgen_bitfield_unit.set(54usize, 1u8, {
            let non_flushable_packet_boundary: u8 = unsafe { ::core::mem::transmute(non_flushable_packet_boundary) };
            non_flushable_packet_boundary as u64
        });
        __bindgen_bitfield_unit.set(55usize, 1u8, {
            let rfu4: u8 = unsafe { ::core::mem::transmute(rfu4) };
            rfu4 as u64
        });
        __bindgen_bitfield_unit.set(56usize, 1u8, {
            let hci_link_supervision_timeout_changed_event: u8 =
                unsafe { ::core::mem::transmute(hci_link_supervision_timeout_changed_event) };
            hci_link_supervision_timeout_changed_event as u64
        });
        __bindgen_bitfield_unit.set(57usize, 1u8, {
            let variable_inquiry_tx_power_level: u8 =
                unsafe { ::core::mem::transmute(variable_inquiry_tx_power_level) };
            variable_inquiry_tx_power_level as u64
        });
        __bindgen_bitfield_unit.set(58usize, 1u8, {
            let enhanced_power_control: u8 = unsafe { ::core::mem::transmute(enhanced_power_control) };
            enhanced_power_control as u64
        });
        __bindgen_bitfield_unit.set(59usize, 1u8, {
            let rfu5: u8 = unsafe { ::core::mem::transmute(rfu5) };
            rfu5 as u64
        });
        __bindgen_bitfield_unit.set(60usize, 1u8, {
            let rfu6: u8 = unsafe { ::core::mem::transmute(rfu6) };
            rfu6 as u64
        });
        __bindgen_bitfield_unit.set(61usize, 1u8, {
            let rfu7: u8 = unsafe { ::core::mem::transmute(rfu7) };
            rfu7 as u64
        });
        __bindgen_bitfield_unit.set(62usize, 1u8, {
            let rfu8: u8 = unsafe { ::core::mem::transmute(rfu8) };
            rfu8 as u64
        });
        __bindgen_bitfield_unit.set(63usize, 1u8, {
            let ext_features: u8 = unsafe { ::core::mem::transmute(ext_features) };
            ext_features as u64
        });
        __bindgen_bitfield_unit
    }
}
#[doc = "Supported HCI commands.\n\n See Core_v5.4, Vol 4, Part E, Section 6.27"]
#[repr(C, packed)]
#[derive(Debug, Copy, Clone)]
pub struct sdc_hci_ip_supported_commands_t {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 49usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of sdc_hci_ip_supported_commands_t"][::core::mem::size_of::<sdc_hci_ip_supported_commands_t>() - 49usize];
    ["Alignment of sdc_hci_ip_supported_commands_t"]
        [::core::mem::align_of::<sdc_hci_ip_supported_commands_t>() - 1usize];
};
impl sdc_hci_ip_supported_commands_t {
    #[inline]
    pub fn hci_inquiry(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_inquiry(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_inquiry_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_inquiry_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_inquiry_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_inquiry_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_inquiry_cancel_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_inquiry_cancel_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_periodic_inquiry_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_periodic_inquiry_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_periodic_inquiry_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_periodic_inquiry_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_exit_periodic_inquiry_mode(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_exit_periodic_inquiry_mode(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_exit_periodic_inquiry_mode_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_exit_periodic_inquiry_mode_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_create_connection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(4usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_create_connection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(4usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_create_connection_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_create_connection_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_disconnect(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(5usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_disconnect(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(5usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_disconnect_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                5usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_disconnect_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                5usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn previously_used_0_6(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(6usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_previously_used_0_6(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(6usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn previously_used_0_6_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                6usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_previously_used_0_6_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                6usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_create_connection_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(7usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_create_connection_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(7usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_create_connection_cancel_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                7usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_create_connection_cancel_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                7usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_accept_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(8usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_accept_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(8usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_accept_connection_request_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_accept_connection_request_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_reject_connection_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(9usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_reject_connection_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(9usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_reject_connection_request_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                9usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_reject_connection_request_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                9usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_link_key_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(10usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_key_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(10usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_link_key_request_reply_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                10usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_link_key_request_reply_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                10usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_link_key_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(11usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_key_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(11usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_link_key_request_negative_reply_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                11usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_link_key_request_negative_reply_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                11usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_pin_code_request_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(12usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_pin_code_request_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(12usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_pin_code_request_reply_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                12usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_pin_code_request_reply_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                12usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_pin_code_request_negative_reply(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(13usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_pin_code_request_negative_reply(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(13usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_pin_code_request_negative_reply_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                13usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_pin_code_request_negative_reply_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                13usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_change_connection_packet_type(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(14usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_change_connection_packet_type(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(14usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_change_connection_packet_type_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                14usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_change_connection_packet_type_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                14usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_authentication_requested(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(15usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_authentication_requested(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(15usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_authentication_requested_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                15usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_authentication_requested_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                15usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_set_connection_encryption(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(16usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_set_connection_encryption(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(16usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_set_connection_encryption_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_set_connection_encryption_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_change_connection_link_key(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(17usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_change_connection_link_key(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(17usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_change_connection_link_key_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                17usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_change_connection_link_key_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                17usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_link_key_selection(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(18usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_link_key_selection(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(18usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_link_key_selection_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                18usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_link_key_selection_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                18usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_remote_name_request(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(19usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_name_request(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(19usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_remote_name_request_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                19usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_remote_name_request_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                19usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_remote_name_request_cancel(&self) -> u8 {
        unsafe { ::core::mem::transmute(self._bitfield_1.get(20usize, 1u8) as u8) }
    }
    #[inline]
    pub fn set_hci_remote_name_request_cancel(&mut self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            self._bitfield_1.set(20usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn hci_remote_name_request_cancel_raw(this: *const Self) -> u8 {
        unsafe {
            ::core::mem::transmute(<__BindgenBitfieldUnit<[u8; 49usize]>>::raw_get(
                ::core::ptr::addr_of!((*this)._bitfield_1),
                20usize,
                1u8,
            ) as u8)
        }
    }
    #[inline]
    pub unsafe fn set_hci_remote_name_request_cancel_raw(this: *mut Self, val: u8) {
        unsafe {
            let val: u8 = ::core::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 49usize]>>::raw_set(
                ::core::ptr::addr_of_mut!((*this)._bitfield_1),
                20usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn hci_read_remote_supported_features(&self) -> u8 {
